[
    {
        "id": "what_are_we_living_in_the_golden_age_of",
        "title": "What are we living in the golden age of?",
        "votes": "",
        "link": "https://www.reddit.com/r/AskReddit/comments/v0r9qs/what_are_we_living_in_the_golden_age_of/",
        "user": "u/001135",
        "comments": [
            {
                "id": "commentCristal1337117k",
                "comment": "Disabled person here.We live in a golden age of accessibility tools based on technological advancements. Just take the car industry as an example. The amount of aftermarket accessibility accessories that were invented in the past 10 years alone, have made driving accessible to many people with disabilities.",
                "level": "1",
                "votes": "1.7k",
                "user": "Cristal1337"
            },
            {
                "id": "commentGrote_Spelers2217",
                "comment": "In about 10 years, all the trains in my country will be wheelchair accessible without needing someone to help you get on using a mobile ramp. Really excited for that.",
                "level": "2",
                "votes": "217",
                "user": "Grote_Spelers"
            },
            {
                "id": "commentCristal1337376",
                "comment": "Judging by your name, you are Dutch (like me)? With a couple of exceptions, the Netherlands is doing a good job at updating their infrastructures. I am looking forward to the changes.",
                "level": "3",
                "votes": "76",
                "user": "Cristal1337"
            },
            {
                "id": "commentXxBlackSheepxX121k",
                "comment": "I'd say cleanliness when compared to past ages, but something about \"The Golden Age of Showers\" doesn't sit right..",
                "level": "1",
                "votes": "2.1k",
                "user": "Xx-BlackSheep-xX"
            },
            {
                "id": "commentgohawkeyes5292528",
                "comment": "The Age of Golden Showers?",
                "level": "2",
                "votes": "528",
                "user": "gohawkeyes529"
            },
            {
                "id": "commentDigitusInRecto3176",
                "comment": "Was 142% sure this was gonna be the \"1 more reply\".",
                "level": "3",
                "votes": "176",
                "user": "DigitusInRecto"
            },
            {
                "id": "commentCountrydiscipline1178k",
                "comment": "Self education. YouTube should be remembered as an important of an invention as the television. We can teach ourselves almost anything, watching enough videos and reading about it online.",
                "level": "1",
                "votes": "17.8k",
                "user": "Countrydiscipline"
            },
            {
                "id": "commentWildcat_twister12227k",
                "comment": "YouTube saved my butt so many times in college when I couldn’t figure out how to do certain types of math problems. I could go watch videos of people doing endless examples of the those kind of problems until I understood how to do them myself",
                "level": "2",
                "votes": "2.7k",
                "user": "Wildcat_twister12"
            },
            {
                "id": "commentWeirdude48123966",
                "comment": "Also helpful for when a professor fails at delivering a concept for thirty minutes and leaves all the students confused, but then you watch some two minute animated video and understand it for life",
                "level": "3",
                "votes": "966",
                "user": "Weirdude4812"
            },
            {
                "id": "commentMal_Reynolds114393",
                "comment": "An Indian man in five minutes explained more than my maths professor in a day",
                "level": "4",
                "votes": "393",
                "user": "Mal_Reynolds11"
            },
            {
                "id": "commentbenjam3n543",
                "comment": "Bless the Indian math instructors on YouTube. They've saved me a few times, mainly with physics and Cs stuff as my main math plug was always organic chemistry tutor.",
                "level": "5",
                "votes": "43",
                "user": "benjam3n"
            },
            {
                "id": "commentNot-an-Ocelot535",
                "comment": "Fam, some Indian guy with a crappy camera and an accent thicker than Tess Holiday taught me more about calculus in 20 minutes than an entire semester of lectures",
                "level": "5",
                "votes": "35",
                "user": "Not-an-Ocelot"
            },
            {
                "id": "commentPretty-Balance-Sheet2710",
                "comment": "This is so true. I've learned countless things that have literally changed my life. Talking about learning to diy, or learning about finance, or what I do professionally.When looking at youtube from that perspective, the removal of the down vote counter is a serious error. If you want to learn, say, how to wire an electric oven you want to know if what your watching is correct or not. The ratio was usually a decent indecator.",
                "level": "2",
                "votes": "710",
                "user": "Pretty-Balance-Sheet"
            },
            {
                "id": "commentxRP953138",
                "comment": "You can get extensions on your browser that let you see the dislikes again.",
                "level": "3",
                "votes": "138",
                "user": "xRP95"
            },
            {
                "id": "commentHolyCloudNinja475",
                "comment": "Only so accurate. As far as I'm aware those extensions are using an old database and then tracking upvotes/downvotes from users with that extension to roughly estimate the current ratio. It's not perfect, and I can only imagine leaves a ton of votes untracked as far as the end user is concerned.",
                "level": "4",
                "votes": "75",
                "user": "HolyCloudNinja"
            },
            {
                "id": "commentPyrefirelight545",
                "comment": "In addition to that, even if the number is \"accurate\" and pulled directly from what the creator sees, how many people are not clicking the down vote anyway? After all, I you don't see a change why click it? Or the people clicking it just to click it.",
                "level": "5",
                "votes": "45",
                "user": "Pyrefirelight"
            },
            {
                "id": "commentDismal_Judgment5290218k",
                "comment": "This is important. I find the people who grew up with YouTube are more likely to self-start and go looking for a tutorial/explanation when they want to educate themselves. Whenever I tell my mother I’m interested in learning something she thinks I should go and do a course. When something needs fixing, you call someone. I’m currently taking a free (and complete) human behavioural biology course on YouTube. A full 25 class Stanford course…for free…and I’m about to fix my built in coffee machine knowing exactly what parts to buy and how to install them for a specific issue. In what other time has education and information been so easily accessible to the masses?",
                "level": "2",
                "votes": "1.8k",
                "user": "Dismal_Judgment5290"
            },
            {
                "id": "commentReagalan3528",
                "comment": "26 classes. Here's the missing one.",
                "level": "3",
                "votes": "528",
                "user": "Reagalan"
            },
            {
                "id": "commentElectricalGuidance794141",
                "comment": "I refer to Sapolsky in my psych masters course as a student, this lecture series specifically, all the time.",
                "level": "4",
                "votes": "141",
                "user": "ElectricalGuidance79"
            },
            {
                "id": "commentiamjustaguy3268",
                "comment": "YouTube University has helped me save thousands of dollars in car repair.",
                "level": "3",
                "votes": "268",
                "user": "iamjustaguy"
            },
            {
                "id": "commentbrzantium497",
                "comment": "I used YouTube to fix both my washer and dryer (each on separate occasions). Saved at least hundreds in repair costs. I have a feeling the handyman clientele is tracking older and older every year.",
                "level": "4",
                "votes": "97",
                "user": "brzantium"
            },
            {
                "id": "commentlambquentin2281",
                "comment": "Taught myself the guitar this way and that was like 10 years ago when I really started to try learning. It was solid then and has only improved more and more. I tell people all the time they can probably learn way more from YouTube if they know how to search what they are looking for.Thank you BobbyCrispy, Marty Schwartz, and JustinGuitar. Y’all made getting through high school and especially college easier.P.S. kids, chicks really do dig guitars.",
                "level": "2",
                "votes": "281",
                "user": "lambquentin"
            },
            {
                "id": "commentRedditor24752625",
                "comment": "Double edged sword though. Lots of misinformation out there",
                "level": "2",
                "votes": "625",
                "user": "Redditor2475"
            },
            {
                "id": "commentVeesla3415",
                "comment": "Part of true research is discerning which information is irrelevant or wrong. It’s a skill that is being lost.",
                "level": "3",
                "votes": "415",
                "user": "Veesla"
            },
            {
                "id": "commentwbruce098489",
                "comment": "It’s a skill many of our kids are starting to learn early, though, both in IRL practice and in schools (well, some schools at least). But you’re right, this is a critical skill that will ultimately distinguish between those who excel, and those who just follow and hope their millions show up one day.",
                "level": "4",
                "votes": "89",
                "user": "wbruce098"
            },
            {
                "id": "commentBlondieeAggiee216",
                "comment": "We remodeled our bathroom using YouTube. I wish my dad was alive so I could tell him how much more in awe of him I am now. He built his own house. He was not a tradesman. He just decided to do it, and did it. There was no YouTube then. I asked my sister how he learned all those things. She said he read books and watched a lot of This Old House.",
                "level": "2",
                "votes": "16",
                "user": "BlondieeAggiee"
            },
            {
                "id": "commentazimuthofficial2206",
                "comment": "I’m surprised this doesn’t have more upvotes because it’s super true. I, unfortunately, went to college RIGHT as YouTube was gaining popularity, for audio engineering, which doesn’t require a degree and can EASILY be learned online.",
                "level": "2",
                "votes": "206",
                "user": "azimuthofficial"
            },
            {
                "id": "commentCountrydiscipline383",
                "comment": "Funny, I did the same exact thing. Ended up leaving that school for audio engineering. I found myself at home on YouTube majority of the time anyway, studying the same thing. Not saying it doesn't have benefits. Networking, face to face, being able to directly ask a question, etc. but for the amount of money being handed over; It's not as worth it.",
                "level": "3",
                "votes": "83",
                "user": "Countrydiscipline"
            },
            {
                "id": "commentcoldhardsteel1168k",
                "comment": "I doubt any will see this now as this post has been going for a while but PALEONTOLOGYThe things we know now about the prehistoric world are mind blowing. More and more is being worked out about the looks and behaviour of dinosaurs and all their fellow extinct organisms. Compared to what was happening when I was a kid we’ve moved on in leaps and bounds.If you haven’t yet, check out Sir David and the BBC’s Prehistoric World. Awesome.Oops. Prehistoric Planet, not Prehistoric World.",
                "level": "1",
                "votes": "16.8k",
                "user": "cold-hard-steel"
            },
            {
                "id": "commentEnderCreeper121239k",
                "comment": "YES THIS. The amount of shit we know is literally insane. We have been able to map sauropod migration routes by locating where the animals got their stomach stones. We have a Triceratops and a juvenile T. rex locked in combat complete with skin impressions being prepped and studied as we speak. The amount of mummified dinosaurs and dinosaurs with skin/feather impressions only continues to increase. Just last year we discovered that the southern continents were home to a whole brand new radiation of ankylosaurs that are totally distinct from their northern cousins and look like they have Aztec war clubs on their tails. The largest megaraptorid known was also just named and the largest abelisaur known is awaiting publication. Pterosaur fuzz was just confirmed to be feathers, meaning the common ancestor of dinosaurs and pterosaurs was likely fuzzy. We have a whole multi age group of teratophoneus tyrannosaurs that were together in life. The utahraptor block continues to provide insights into the largest known raptors and how they lived, hinting at sociality and also showing us how the animals grew from tiny lizard-bird to hulking ground bear-eagle-dragon (still needs funding btw if anyone is feeling generous look up the utahraptor project). Our knowledge of marine reptiles and pterosaurs are at an all time high and we have been able reconstruct the lives and appearances of both these animals in astonishing detail. Pterosaurs in particular have been discovered to have been one of if not the greatest vertebrate flyers of all time, even better than birds, and had astonishing life cycles with bizarre strategies by our modern standards it’s wild.The future of the past is bright as fuck it’s nearly blinding.Also yes go watch Sir David Attenborough in Prehistoric Planet on Apple’s thing it’s the best window into the past ever put to screen and showcases a lot of what I was talking about above and even more. Go watch it. Now. Please.",
                "level": "2",
                "votes": "3.9k",
                "user": "EnderCreeper121"
            },
            {
                "id": "commentAlwaysSunnyDragRace3681",
                "comment": "Alright I’ll watch",
                "level": "3",
                "votes": "681",
                "user": "AlwaysSunnyDragRace"
            }
        ]
    },
    {
        "id": "if_you_were_in_death_row_what_would_your_last",
        "title": "If you were in death row, what would your last meal request be?",
        "votes": "496",
        "link": "https://www.reddit.com/r/AskReddit/comments/v0y14n/if_you_were_in_death_row_what_would_your_last/",
        "user": "u/old_dioxide",
        "comments": [
            {
                "id": "commentgreenygp191105",
                "comment": "My Grandmas homemade sausage rolls.The sausage rolls weren’t anything special, but Grandmas dead so i figure it buys me some time.",
                "level": "1",
                "votes": "105",
                "user": "greenygp19"
            },
            {
                "id": "commentNiwi_2Vote",
                "comment": "I also choose this guys dead grandmas sausage",
                "level": "2",
                "votes": "Vote",
                "user": "Niwi_"
            },
            {
                "id": "commentNeuronVirusLabs3Vote",
                "comment": "his dead grandmas sausage sounds weird as hell lmao",
                "level": "3",
                "votes": "Vote",
                "user": "NeuronVirusLabs"
            },
            {
                "id": "commentSAS96241495",
                "comment": "Cyanide. You cant kill me, i kill me",
                "level": "1",
                "votes": "495",
                "user": "SAS9624"
            },
            {
                "id": "commentDuuuuude_WTF2105",
                "comment": "Twist: it dissolved your jaw but didn’t kill you.",
                "level": "2",
                "votes": "105",
                "user": "Duuuuude_WTF"
            },
            {
                "id": "commentPackofPretzels371",
                "comment": "What if I put it through my ass",
                "level": "3",
                "votes": "71",
                "user": "PackofPretzels"
            },
            {
                "id": "commentAva210444",
                "comment": "Step-cyanide, what are you doing?",
                "level": "4",
                "votes": "44",
                "user": "Ava210"
            },
            {
                "id": "commentJouuf429",
                "comment": "yes daddy",
                "level": "4",
                "votes": "29",
                "user": "Jouuf"
            },
            {
                "id": "commentNooseents318",
                "comment": "Silva, is that you?",
                "level": "3",
                "votes": "18",
                "user": "Nooseents"
            },
            {
                "id": "commentAdvocateSaint310",
                "comment": "\"Look upon your work, mother.\"",
                "level": "3",
                "votes": "10",
                "user": "AdvocateSaint"
            },
            {
                "id": "commentHalio34433",
                "comment": "Twist: cyanide does not work like that, it’s not caustic enough.",
                "level": "3",
                "votes": "3",
                "user": "Halio344"
            },
            {
                "id": "commentProfessional_Emu73041100",
                "comment": "A uranium rod.",
                "level": "1",
                "votes": "100",
                "user": "Professional_Emu7304"
            },
            {
                "id": "commentyyyyyyyyyyyyyy99237",
                "comment": "What are you waiting for then? Edit your comment to \"a uranium rod\"! Edit: thank you",
                "level": "2",
                "votes": "37",
                "user": "yyyyyyyyyyyyyy99"
            },
            {
                "id": "commentJamieDrone314",
                "comment": "What was the original?",
                "level": "3",
                "votes": "14",
                "user": "JamieDrone"
            },
            {
                "id": "commenteschuylerhamilton47",
                "comment": "Right. This is confusing.",
                "level": "4",
                "votes": "7",
                "user": "eschuylerhamilton"
            },
            {
                "id": "commentyyyyyyyyyyyyyy9946",
                "comment": "\"An uranium rod\"",
                "level": "4",
                "votes": "6",
                "user": "yyyyyyyyyyyyyy99"
            },
            {
                "id": "commentJamieDrone5Vote",
                "comment": "Ohhhhhh thsnks",
                "level": "5",
                "votes": "Vote",
                "user": "JamieDrone"
            },
            {
                "id": "commentmyonkin235",
                "comment": "Uranium begins with a consonant sound so you would use ‘a’ here instead of ‘an’.Why yes, I am a grammar nazi.",
                "level": "2",
                "votes": "35",
                "user": "myonkin"
            },
            {
                "id": "commentIndyCallisto30",
                "comment": "not in this case though",
                "level": "3",
                "votes": "0",
                "user": "IndyCallisto"
            },
            {
                "id": "commentmyonkin43",
                "comment": "I’m not a grammar nazi in this case?",
                "level": "4",
                "votes": "3",
                "user": "myonkin"
            },
            {
                "id": "commentVXNBC1386",
                "comment": "My mom's homemade mac and cheese, homemade hot wings.",
                "level": "1",
                "votes": "386",
                "user": "VXNBC"
            },
            {
                "id": "commentAladdinTheGenie245",
                "comment": "sounds lovely",
                "level": "2",
                "votes": "45",
                "user": "AladdinTheGenie"
            },
            {
                "id": "commentbebe_0808324",
                "comment": "Ah the dupe comment glitch lmao",
                "level": "3",
                "votes": "24",
                "user": "bebe_0808"
            },
            {
                "id": "commentbeluuuuuuga417",
                "comment": "Listen very carefully here is the recipe for eterna....",
                "level": "4",
                "votes": "17",
                "user": "beluuuuuuga"
            },
            {
                "id": "commentDonQuixBalls32",
                "comment": "She's alright.",
                "level": "3",
                "votes": "2",
                "user": "DonQuixBalls"
            },
            {
                "id": "commentTru-Queer27",
                "comment": "Chicken wing, chicken wing, cheese and macaroni, hot dogs and bologna, hangin wit my homies",
                "level": "2",
                "votes": "7",
                "user": "Tru-Queer"
            },
            {
                "id": "commentAladdinTheGenie211",
                "comment": "sounds lovely",
                "level": "2",
                "votes": "11",
                "user": "AladdinTheGenie"
            },
            {
                "id": "commentbebe_080839",
                "comment": "Ah the dupe comment glitch lmao",
                "level": "3",
                "votes": "9",
                "user": "bebe_0808"
            },
            {
                "id": "commentbeluuuuuuga416",
                "comment": "l life: 1 tablespoon of paprika, 2 shakes of salt, a quarter butter knife cut of butter.",
                "level": "4",
                "votes": "16",
                "user": "beluuuuuuga"
            },
            {
                "id": "commentgalwegian1308",
                "comment": "Lobster bisque and shrimp cocktail. allergic to shellfish. cheats executioner.",
                "level": "1",
                "votes": "308",
                "user": "galwegian"
            },
            {
                "id": "commentDuuuuude_WTF2133",
                "comment": "Twist: two hours of swollen eyes and agonizing body rash before you get to see the executioner.",
                "level": "2",
                "votes": "133",
                "user": "Duuuuude_WTF"
            }
        ]
    },
    {
        "id": "youve_been_granted_the_power_to_bless_people_with",
        "title": "You’ve been granted the power to bless people with minor conveniences. How do you make their lives slightly better?",
        "votes": "1504",
        "link": "https://www.reddit.com/r/AskReddit/comments/v0ssu1/youve_been_granted_the_power_to_bless_people_with/",
        "user": "u/AdAppropriate6975",
        "comments": [
            {
                "id": "commentMisterBastahrd116k",
                "comment": "Your keys, wallet, and phone are always where you expect them to be.",
                "level": "1",
                "votes": "1.6k",
                "user": "MisterBastahrd"
            },
            {
                "id": "commentSpareUmbrella2489",
                "comment": "Considering this would mean my phone, keys, and wallet can't ever be stolen, I'd say this is more a moderate convenience.",
                "level": "2",
                "votes": "489",
                "user": "SpareUmbrella"
            },
            {
                "id": "commentmorkengork3320",
                "comment": "Unless they were stolen in front of you, in which case you now expect them to be missing.",
                "level": "3",
                "votes": "320",
                "user": "morkengork"
            },
            {
                "id": "commentPeople_are_stup1489",
                "comment": "And 5 minutes later you forgot sonthey just reapear in your pocket.",
                "level": "4",
                "votes": "89",
                "user": "People_are_stup1"
            },
            {
                "id": "commentbugenhagen152104",
                "comment": "The question was for minor conviences. This would be life altering ...... for me.",
                "level": "2",
                "votes": "104",
                "user": "bugenhagen15"
            },
            {
                "id": "commentphatrogue232",
                "comment": "People get a bowl, heck make it a fancy bowl from a housewares store, put in near your front door and create a habit of emptying your pockets into it as you come home. You have been blessed!",
                "level": "2",
                "votes": "32",
                "user": "phatrogue"
            },
            {
                "id": "commentTess-Dubois39",
                "comment": "Then burglars come with a fishing rod or long wire and steal them through the letterbox.",
                "level": "3",
                "votes": "9",
                "user": "Tess-Dubois"
            },
            {
                "id": "commenticantthinkofaname9401476",
                "comment": "You'll always remember why you walked into a room or where you last put the item you need.",
                "level": "1",
                "votes": "476",
                "user": "icantthinkofaname940"
            },
            {
                "id": "commentIncorect_Speling248",
                "comment": "What if, me forgetting and having to walk again later is how I exercise? Will I get fat? Is my health relying on so little?",
                "level": "2",
                "votes": "48",
                "user": "Incorect_Speling"
            },
            {
                "id": "commentInteresting-Gear-81932",
                "comment": "Maybe. But capitalism can solve this for you. Just buy a bigger house and place things regulary where you need to walk a distance to it then.",
                "level": "3",
                "votes": "2",
                "user": "Interesting-Gear-819"
            },
            {
                "id": "commentupboat_113k",
                "comment": "Their butter is always at the perfect consistency for being spread.",
                "level": "1",
                "votes": "1.3k",
                "user": "upboat_"
            },
            {
                "id": "commentWokTheDoc2303",
                "comment": "No more Cake or bread being made. Butter now has a very short shelf life. There is famine worldwide and millions starve. You are an inconsiderate monster. Good job Daniel.",
                "level": "2",
                "votes": "303",
                "user": "WokTheDoc"
            },
            {
                "id": "commentMagply3217",
                "comment": "THEIR butter. Are they the butter baron or something?",
                "level": "3",
                "votes": "217",
                "user": "Magply"
            },
            {
                "id": "commentShrikeAgent443",
                "comment": "I can't be out of butter, I'm the butter baron!",
                "level": "4",
                "votes": "43",
                "user": "ShrikeAgent"
            },
            {
                "id": "commentHector_Tueux314",
                "comment": "Butter in bread ?",
                "level": "3",
                "votes": "14",
                "user": "Hector_Tueux"
            },
            {
                "id": "commentSurpriseCaboose410",
                "comment": "Yes, it is a common ingredient for bread. Not ALL bread needs it, but richer doughs do.",
                "level": "4",
                "votes": "10",
                "user": "SurpriseCaboose"
            },
            {
                "id": "commentHector_Tueux59",
                "comment": "Ok. Where I am we don't put butter in bread, only flour, yeast, salt and water.",
                "level": "5",
                "votes": "9",
                "user": "Hector_Tueux"
            },
            {
                "id": "commentmeddl_leute339",
                "comment": "Yeah fucking thank you Daniel",
                "level": "3",
                "votes": "39",
                "user": "meddl_leute"
            },
            {
                "id": "commentKickballJamal113k",
                "comment": "Clean wipe every time you poop.",
                "level": "1",
                "votes": "1.3k",
                "user": "KickballJamal"
            },
            {
                "id": "commentPipweak_2132",
                "comment": "this is the golden one here",
                "level": "2",
                "votes": "132",
                "user": "Pipweak_"
            },
            {
                "id": "commentWimbleWimble359",
                "comment": "Thousands of rampaging scat fetishists storm the Capitol.Ok well a dozen or so at max.",
                "level": "3",
                "votes": "59",
                "user": "WimbleWimble"
            },
            {
                "id": "commentwrcker276",
                "comment": "You sir are a god among men.",
                "level": "2",
                "votes": "76",
                "user": "wrcker"
            },
            {
                "id": "commentTheKnightsWhoSayNyet236",
                "comment": "I'd save so much money on toilet paper",
                "level": "2",
                "votes": "36",
                "user": "TheKnightsWhoSayNyet"
            },
            {
                "id": "commentcutelyaware326",
                "comment": "Don't put your money on toilet paper",
                "level": "3",
                "votes": "26",
                "user": "cutelyaware"
            },
            {
                "id": "commentVinceGchillin220",
                "comment": "That is a major convenience",
                "level": "2",
                "votes": "20",
                "user": "VinceGchillin"
            },
            {
                "id": "commentzalinanaruto238",
                "comment": "bidet",
                "level": "2",
                "votes": "38",
                "user": "zalinanaruto"
            },
            {
                "id": "commentShelZuuz334",
                "comment": "Bidet to you, sir!",
                "level": "3",
                "votes": "34",
                "user": "ShelZuuz"
            },
            {
                "id": "commentireply2idiots35",
                "comment": "People don’t get how life changing they are.",
                "level": "3",
                "votes": "5",
                "user": "ireply2idiots"
            },
            {
                "id": "commentGalastique1908",
                "comment": "Odorless, silent farts that always get rid of your stomach aches",
                "level": "1",
                "votes": "908",
                "user": "Galastique"
            },
            {
                "id": "commentmy_non_fap_account282",
                "comment": "I imagine a world similar to Children of Men but with a loud and smelly fart as the plot",
                "level": "2",
                "votes": "82",
                "user": "my_non_fap_account"
            },
            {
                "id": "commentstuiterveer343",
                "comment": "A fart so loud and smelly it stops an entire war dead in its tracks for a couple of minutes",
                "level": "3",
                "votes": "43",
                "user": "stuiterveer"
            }
        ]
    },
    {
        "id": "what_are_good_movies_where_the_good_guy_losses",
        "title": "What are good movies where the good guy losses?",
        "votes": "158",
        "link": "https://www.reddit.com/r/AskReddit/comments/v11uy6/what_are_good_movies_where_the_good_guy_losses/",
        "user": "u/un-original420420420",
        "comments": [
            {
                "id": "commentBuster_Nutt1189",
                "comment": "No Country For Old Men... I think.",
                "level": "1",
                "votes": "189",
                "user": "Buster_Nutt"
            },
            {
                "id": "commentjoepjah257",
                "comment": "Yep, even though the good guy is not an archetype good guy... He's just... not a bad guy.",
                "level": "2",
                "votes": "57",
                "user": "joepjah"
            },
            {
                "id": "commentbeeple69224",
                "comment": "Javier Bardem acting was next level",
                "level": "2",
                "votes": "24",
                "user": "beeple69"
            },
            {
                "id": "commentOverall_Cookie_63026",
                "comment": "It was the first movie that came to my mind.",
                "level": "2",
                "votes": "6",
                "user": "Overall_Cookie_630"
            },
            {
                "id": "comment420BIF27",
                "comment": "There were no good guys in no country for old men.",
                "level": "2",
                "votes": "7",
                "user": "420BIF"
            },
            {
                "id": "commentacousticsoup326",
                "comment": "Tommy Lee Jones was. He did all he could and retired in the end because that country he was working in wasn’t meant for old men.",
                "level": "3",
                "votes": "26",
                "user": "acousticsoup"
            },
            {
                "id": "commentOk_Organization_341521",
                "comment": "First movie that came to my mind",
                "level": "2",
                "votes": "1",
                "user": "Ok_Organization_3415"
            },
            {
                "id": "commentShnoochieboochies1143",
                "comment": "Se7en",
                "level": "1",
                "votes": "143",
                "user": "Shnoochieboochies"
            },
            {
                "id": "commentshuhly234",
                "comment": "I was just going to say this. Se7en is the perfect example. Mills chose wrath.",
                "level": "2",
                "votes": "34",
                "user": "shuhly"
            },
            {
                "id": "commentfarts_in_the_breeze213",
                "comment": "What's in the box?",
                "level": "2",
                "votes": "13",
                "user": "farts_in_the_breeze"
            },
            {
                "id": "commentHughJanus352Vote",
                "comment": "I can't watch any dead bodies or horror in general, so i skipped that movie.But it is a masterpiece, i have read the script without watching the movie.",
                "level": "2",
                "votes": "Vote",
                "user": "HughJanus35"
            },
            {
                "id": "comment_Goose_1108",
                "comment": "The Cabin in the Woods",
                "level": "1",
                "votes": "108",
                "user": "_Goose_"
            },
            {
                "id": "commentScary-Pomegranate-60231",
                "comment": "My favorite horror movie of all time But the monster god does win? 🤨",
                "level": "2",
                "votes": "31",
                "user": "Scary-Pomegranate-60"
            },
            {
                "id": "comment-1",
                "comment": "",
                "level": -1,
                "votes": "",
                "user": ""
            },
            {
                "id": "comment-1",
                "comment": "",
                "level": -1,
                "votes": "",
                "user": ""
            },
            {
                "id": "commentWalter_Padick180",
                "comment": "The Thing",
                "level": "1",
                "votes": "80",
                "user": "Walter_Padick"
            },
            {
                "id": "commentsharrrper220",
                "comment": "Bad guy doesn't win either though, but you're not wrong.",
                "level": "2",
                "votes": "20",
                "user": "sharrrper"
            },
            {
                "id": "commentWalter_Padick35",
                "comment": "I hear ya, but we don't know if the bad guy one. There's either two good guys left at the end, or 1 bad and 1 good. Either way, good guys lose.",
                "level": "3",
                "votes": "5",
                "user": "Walter_Padick"
            },
            {
                "id": "commentTheSpiderEpisode25",
                "comment": "I already used my one Keith David joke for today. I’ll try back tomorrow.",
                "level": "2",
                "votes": "5",
                "user": "TheSpiderEpisode"
            },
            {
                "id": "commentPathedius158",
                "comment": "I don't know if it's a straight up good guys and bad guys. And I wouldn't consider it a complete loss with the outcome. But I'd say watchmen is a pretty good movie where it's kinda is a loss but also kinda isn't",
                "level": "1",
                "votes": "58",
                "user": "Pathedius"
            },
            {
                "id": "commentDrunkCricket1220",
                "comment": "Tbh everyone loses",
                "level": "2",
                "votes": "20",
                "user": "DrunkCricket1"
            },
            {
                "id": "commentPorrick312",
                "comment": "But everyone loses less than if his plan hadn't worked - it was to avert nuclear war, remember!",
                "level": "3",
                "votes": "12",
                "user": "Porrick"
            },
            {
                "id": "commentrebuildmylifenow4Vote",
                "comment": "But nothing ever really ends...",
                "level": "4",
                "votes": "Vote",
                "user": "rebuildmylifenow"
            },
            {
                "id": "commentfoldingcouch2Vote",
                "comment": "I think the entire point of Watchmen is that the entire concept of \"good\" and \"bad\" that comic book heros exemplify is basically bogus.So what matters? Doing the right thing or getting the right outcome?",
                "level": "2",
                "votes": "Vote",
                "user": "foldingcouch"
            },
            {
                "id": "commentnbd1887160",
                "comment": "Usual Suspects",
                "level": "1",
                "votes": "60",
                "user": "nbd1887"
            },
            {
                "id": "commentjopperjawZ27",
                "comment": "How? Verbal is the most sympathetic character in the whole movie. Even after the reveal, it still feels like the good guy wins.",
                "level": "2",
                "votes": "7",
                "user": "jopperjawZ"
            },
            {
                "id": "commentLawProud492327",
                "comment": "The whole movie is from the perspective of an unreliable criminal narrator. So I doubt he was as sympathetic as he painted himself",
                "level": "3",
                "votes": "27",
                "user": "LawProud492"
            },
            {
                "id": "commentjopperjawZ46",
                "comment": "Based on the reveal, he obviously wasn't as sympathetic as he painted himself to be. But that doesn't change how you're meant to think of the character throughout the movie. By the time you get to the end, your emotional invested in Verbal in a way that you never are with the other characters.",
                "level": "4",
                "votes": "6",
                "user": "jopperjawZ"
            },
            {
                "id": "commentdroplightning310",
                "comment": "Verbal isn’t a real person. It’s keyser soze playing a character.",
                "level": "3",
                "votes": "10",
                "user": "droplightning"
            },
            {
                "id": "commentSniffleBot33",
                "comment": "In the sense that we learn at the end that he killed all the other main characters and was the guy Chazz Palminteri was really looking for all along.",
                "level": "3",
                "votes": "3",
                "user": "SniffleBot"
            },
            {
                "id": "commentagreeingstorm91255",
                "comment": "Empire Strikes Back. It's kind of interesting when you think about because it's probably the best film of the series yet the good guys get their asses thoroughly kicked in every way throughout the film. The film starts with them evacuating their base under enemy fire. By the time the movie is over Han is in carbonite, C3PO has been blown to pieces, Luke has lost not only his hand but his fantasy of who his father is and his trust in Obi-wan has been shaken. Leia has discovered she loves Han and then lost him. They are running for their lives in a ship piloted by a guy who has betrayed them. They have lost in every conceivable way.",
                "level": "1",
                "votes": "255",
                "user": "agreeingstorm9"
            }
        ]
    },
    {
        "id": "whats_not_as_attractive_as_people_think",
        "title": "What's not as attractive as people think?",
        "votes": "1953",
        "link": "https://www.reddit.com/r/AskReddit/comments/v0nbfk/whats_not_as_attractive_as_people_think/",
        "user": "u/koolxxxxxxxx",
        "comments": [
            {
                "id": "commenttiny_butt_toucher134k",
                "comment": "Photos edited past the point of recognition.",
                "level": "1",
                "votes": "3.4k",
                "user": "tiny_butt_toucher"
            },
            {
                "id": "commentbeluuuuuuga2604",
                "comment": "I can't believe so many people just get rid of all their wrinkles and skin tone it's so weird. I actually really like stuff like smile lines it just shows how someone is probably quite kind :)",
                "level": "2",
                "votes": "604",
                "user": "beluuuuuuga"
            },
            {
                "id": "commentheeywewantsomenewday3170",
                "comment": "I say this all the time. You cant fall in love with edited.. love is in the quirks and imperfections.",
                "level": "3",
                "votes": "170",
                "user": "heeywewantsomenewday"
            },
            {
                "id": "commentBatherick415",
                "comment": "r/instagramreality agrees with you",
                "level": "4",
                "votes": "15",
                "user": "Batherick"
            },
            {
                "id": "commentEzekku128k",
                "comment": "The sun tan (usually fake) than makes people look like oranges",
                "level": "1",
                "votes": "2.8k",
                "user": "Ezekku"
            },
            {
                "id": "commentMackem1012613",
                "comment": "Going out for a few pints in most city centres in England is like visiting Wonka's chocolate factory.",
                "level": "2",
                "votes": "613",
                "user": "Mackem101"
            },
            {
                "id": "commentAshDargon3251",
                "comment": "Couldn't have said it better myself, my sister is transitioning into an oompa loompa and it is disappointing",
                "level": "3",
                "votes": "251",
                "user": "AshDargon"
            },
            {
                "id": "commentKittySucks694102",
                "comment": "I have no problem with trans people, but transitioning into an oompa loompa is just wrong.",
                "level": "4",
                "votes": "102",
                "user": "KittySucks69"
            },
            {
                "id": "commentAshDargon515",
                "comment": "Agreed, she becomes more oompa loompa by the day",
                "level": "5",
                "votes": "15",
                "user": "AshDargon"
            },
            {
                "id": "commentPsychoNauticalFaux2190",
                "comment": "This is so true lmao there’s this one girl I know who goes crazy with that shit. I want to tell her it looks terrible but she’d probably just keep doing it anyways.",
                "level": "2",
                "votes": "190",
                "user": "PsychoNauticalFaux"
            },
            {
                "id": "commentbeluuuuuuga399",
                "comment": "I remember watching , I think it was something like a vice video, of a lady who had managed to turn herself completely black from all the tanning beds she'd used.It's kinda sad to think about how she had such body dismophia that she did that but also that she was increasing her risk of skin cancer exponentially.",
                "level": "3",
                "votes": "99",
                "user": "beluuuuuuga"
            },
            {
                "id": "commentLunavixen15431",
                "comment": "Her skin would be so leathery she could probably get stuff out of the oven without an oven mitt",
                "level": "4",
                "votes": "31",
                "user": "Lunavixen15"
            },
            {
                "id": "commentDanni293471",
                "comment": "Exponential?! Her skin turned black, she factorialed her chances at least.",
                "level": "4",
                "votes": "71",
                "user": "Danni293"
            },
            {
                "id": "commenthalfmeasures611133k",
                "comment": "being popular on social media",
                "level": "1",
                "votes": "3.3k",
                "user": "halfmeasures611"
            },
            {
                "id": "commentprocrastinatinq216k",
                "comment": "i find it so attractive when a guy has no social media presence",
                "level": "2",
                "votes": "1.6k",
                "user": "procrastinatinq"
            },
            {
                "id": "commentSayIWont5023906",
                "comment": "Same. A woman who gives no fucks about social media has an air of maturity and sophistication that I find very attractive.",
                "level": "3",
                "votes": "906",
                "user": "SayIWont502"
            },
            {
                "id": "commentCat-in-a-small-box4235",
                "comment": "I am only on Reddit and have some messenger apps, but fucking hell I‘m not sophisticated and not really mature. Just never learned to do it.",
                "level": "4",
                "votes": "235",
                "user": "Cat-in-a-small-box"
            },
            {
                "id": "commentnonchalantdilletante394",
                "comment": "I’m desperate to find someone like this and here I am, perpetually online",
                "level": "3",
                "votes": "94",
                "user": "nonchalantdilletante"
            },
            {
                "id": "commentDorky_Glacier3105",
                "comment": "Yes, and even his profile is a dark circle <3",
                "level": "3",
                "votes": "105",
                "user": "Dorky_Glacier"
            },
            {
                "id": "commentFirree2186",
                "comment": "Seriously, this is the reason I never want to be famous for any reason. Social media is a battlefield where hate armies can be sent to ruin your life in an instant. I'd rather just be a happy, successful person who flies under the radar.",
                "level": "2",
                "votes": "186",
                "user": "Firree"
            },
            {
                "id": "commentdbsx772277",
                "comment": "My roommate’s college friends visited over the weekend. We were having a few drinks together when two of them started talking about how many followers they have on TikTok and how many views they’ve gotten on some of their videos. Then they showed us some of the more viral videos of theirs. It took all of the dormant acting skills I have to feign polite interest. It probably lasted 10 minutes tops but it was still 10 mins too many.It was sad, really.I remember when MySpace was the platform, but even back then I don’t remember taking the size of my friend list seriously, or thinking of it as proof of my personal or social value. I realize I’m probably in the minority, but I can honestly say that I’ve never cared about how many followers I have or likes I get. My self esteem is shoddy as it is without attaching any perceived value to that sort of thing anyways, lol",
                "level": "2",
                "votes": "277",
                "user": "dbsx77"
            },
            {
                "id": "commentJerseygirl13713127",
                "comment": "I miss myspaces ability to decorate my page and add music",
                "level": "3",
                "votes": "127",
                "user": "Jerseygirl1371"
            },
            {
                "id": "commentXoGossipgoat94411",
                "comment": "I learnt how to write basic HTML codes when I was 12 using MySpace.",
                "level": "4",
                "votes": "11",
                "user": "XoGossipgoat94"
            },
            {
                "id": "commentMesanych2129",
                "comment": "I don't even have social media, except for Google and Reddit. Essentially any social media whose purpose is to gain the most popularity through their profile.",
                "level": "2",
                "votes": "129",
                "user": "Mesanych"
            },
            {
                "id": "commentguyWithScrotum376",
                "comment": "How is Google a social media?",
                "level": "3",
                "votes": "76",
                "user": "guyWithScrotum"
            },
            {
                "id": "commentDon_Thuglayo4140",
                "comment": "Never heard of Google+ guess you missed your invite",
                "level": "4",
                "votes": "140",
                "user": "Don_Thuglayo"
            },
            {
                "id": "commentExpress_Ad2962576",
                "comment": "Nobody knew about it, so it died a quick death",
                "level": "5",
                "votes": "76",
                "user": "Express_Ad2962"
            },
            {
                "id": "commentnoteveryagain135k",
                "comment": "Having 8 electrons in your outer shell.",
                "level": "1",
                "votes": "3.5k",
                "user": "noteveryagain"
            },
            {
                "id": "comment2baked213k",
                "comment": "how noble.",
                "level": "2",
                "votes": "1.3k",
                "user": "2baked"
            },
            {
                "id": "commentnoteveryagain3675",
                "comment": "Thank you! I feel like we share a bond.",
                "level": "3",
                "votes": "675",
                "user": "noteveryagain"
            },
            {
                "id": "commentGalacticDogger4535",
                "comment": "Stop it you guys. You're all bohring me.",
                "level": "4",
                "votes": "535",
                "user": "GalacticDogger"
            }
        ]
    },
    {
        "id": "what_has_no_reason_to_exist_in_2022_and_yet_it",
        "title": "What has no reason to exist in 2022 and yet it does?",
        "votes": "158",
        "link": "https://www.reddit.com/r/AskReddit/comments/v0zbuk/what_has_no_reason_to_exist_in_2022_and_yet_it/",
        "user": "u/_sawako",
        "comments": [
            {
                "id": "commentFrn0711248",
                "comment": "Ticketmaster. How in the world have they not yet found a viable competition with reduced rates?",
                "level": "1",
                "votes": "248",
                "user": "Frn071"
            },
            {
                "id": "commentseraph089280",
                "comment": "The entire point is that Ticketmaster is the scapegoat people blame for prices being so high. They're owned by Live Nation, who operate the venues and promote all of the events.",
                "level": "2",
                "votes": "80",
                "user": "seraph089"
            },
            {
                "id": "commentmbz321315",
                "comment": "So it's the same thing...what difference does it make?",
                "level": "3",
                "votes": "15",
                "user": "mbz321"
            },
            {
                "id": "commentdysfunctionz427",
                "comment": "If Ticketmaster wasn’t charging those fees then the venue would just be charging higher prices. Ticketmaster’s entire business model is looking like the bad guy, adding on unreasonable fees so it looks like the venue or performer is charging a reasonable price.",
                "level": "4",
                "votes": "27",
                "user": "dysfunctionz"
            },
            {
                "id": "commentwhyliepornaccount521",
                "comment": "Yeah, no.Ticketmaster's business model is a monopoly. They own the venues. So \"looking like the bad guy so that venue doesn't\" doesn't really make sense here...",
                "level": "5",
                "votes": "21",
                "user": "whyliepornaccount"
            },
            {
                "id": "commentdysfunctionz615",
                "comment": "Both of those things are true. They are a (near) monopoly and can dictate prices, but also they intentionally structure fees so it doesn’t look like Taylor Swift is gouging fans for example.",
                "level": "6",
                "votes": "15",
                "user": "dysfunctionz"
            },
            {
                "id": "commentPrettybuoy76",
                "comment": "My friend got us lady Gaga tickets and they charged a $30 processing fee and another $25 handling fee on top of our $80 tickets. Each! I don't understand the process and handling since ordering through the internet should be like auto processed on it's own. Ridiculous",
                "level": "7",
                "votes": "6",
                "user": "Prettybuoy"
            },
            {
                "id": "commentNativeMasshole52",
                "comment": "But they own a lot of their venues?",
                "level": "5",
                "votes": "2",
                "user": "NativeMasshole"
            },
            {
                "id": "commentPornthrowaway7852",
                "comment": "Does Ticketmaster give a percentage of its sales to the artist? That seems improbable to me.",
                "level": "5",
                "votes": "2",
                "user": "Pornthrowaway78"
            },
            {
                "id": "commentwetgear5Vote",
                "comment": "This is not true. Buying tickets at the box office from the venue saves the fees. The most extra I’ve ever been charged at the BO is $1/ticket. I’ve bought 100s of tickets at dozens of venues this way. It’s not the most convenient but it’s better than giving a dime to Ticketmaster.",
                "level": "5",
                "votes": "Vote",
                "user": "wetgear"
            },
            {
                "id": "commentstink3rbelle210",
                "comment": "Corporate collusion (at least implicitly). If they all charge the same outrageous fees, people have to pay them. Very often, corporations have the same interests as each other, and wouldn't benefit from actual competition.",
                "level": "2",
                "votes": "10",
                "user": "stink3rbelle"
            },
            {
                "id": "commentDragoonXNucleon27",
                "comment": "Monopoly.If you don't use TM you don't get the big acts.",
                "level": "2",
                "votes": "7",
                "user": "DragoonXNucleon"
            },
            {
                "id": "commentG-Unit111112Vote",
                "comment": "And Stub Hub isn't much better. Fuck Stub Hub.",
                "level": "2",
                "votes": "Vote",
                "user": "G-Unit11111"
            },
            {
                "id": "commentCrazyPlato2Vote",
                "comment": "Exclusivity contracts and other forms of market manipulation, apparently",
                "level": "2",
                "votes": "Vote",
                "user": "CrazyPlato"
            },
            {
                "id": "commentManuelfrde1306",
                "comment": "Cereal bags that cannot be resealed.",
                "level": "1",
                "votes": "306",
                "user": "Manuelfrde"
            },
            {
                "id": "commentpeon2247",
                "comment": "Cereal, chips, etc bags, you think would all be ziploc style. It wouldn't be a big cost increase as the ziploc bags themselves are like 50 for $1.Although knowing how these things usually work there's probably 1 dude that owns all the patents for the technology and refuses to sell",
                "level": "2",
                "votes": "47",
                "user": "peon2"
            },
            {
                "id": "commentUmbertoEcoTheDolphin371",
                "comment": "His zips are sealed.",
                "level": "3",
                "votes": "71",
                "user": "UmbertoEcoTheDolphin"
            },
            {
                "id": "commentshunkamunka415",
                "comment": "Oh my fuck. Usually the puns on Reddit can get pretty tiring, but this one, this one I like.",
                "level": "4",
                "votes": "15",
                "user": "shunkamunka"
            },
            {
                "id": "commentOpen_Balance_598842",
                "comment": "Class.",
                "level": "4",
                "votes": "2",
                "user": "Open_Balance_5988"
            },
            {
                "id": "commentwigginsadam80223",
                "comment": "They aren't resealable so you'll eat the product faster and buy more.",
                "level": "2",
                "votes": "23",
                "user": "wigginsadam80"
            },
            {
                "id": "commentaistivy34",
                "comment": "I wonder what keeps them from not using bags at all. Box technology can’t be that hard! (waits anxiously to see complicated box tech)",
                "level": "3",
                "votes": "4",
                "user": "aistivy"
            },
            {
                "id": "commenttrollingraven2Vote",
                "comment": "I pour them into Tupperware specifically designed for cereal.Saves packaging. Much fresher and more convenient as well as tells you how much you have left.And dealing with resealable things in other packaging.. they mostly just suck as you can’t easily open them or you rip the packaging so it can’t be resealed or you can’t easily reseal it because of the cheap or easily ruined systems they use.",
                "level": "2",
                "votes": "Vote",
                "user": "trollingraven"
            },
            {
                "id": "commentRifleShower169",
                "comment": "Henry Kissinger. How is he still alive?",
                "level": "1",
                "votes": "69",
                "user": "RifleShower"
            },
            {
                "id": "commentChairish29",
                "comment": "My man just turned 99 three days ago.",
                "level": "2",
                "votes": "9",
                "user": "Chairish"
            },
            {
                "id": "commentUmbertoEcoTheDolphin216",
                "comment": "He's like reverse Betty White.",
                "level": "2",
                "votes": "16",
                "user": "UmbertoEcoTheDolphin"
            },
            {
                "id": "commentRifleShower36",
                "comment": "Wouldn’t that mean somebody who doesn’t live and is destined to die young, ie James Dean?",
                "level": "3",
                "votes": "6",
                "user": "RifleShower"
            },
            {
                "id": "commentCypripediumCalceolus4Vote",
                "comment": "I think it means a pretentious person nobody likes.",
                "level": "4",
                "votes": "Vote",
                "user": "CypripediumCalceolus"
            },
            {
                "id": "commentthrowaway_martinez22",
                "comment": "Bohemian Grove black magic & virgin sacrifices",
                "level": "2",
                "votes": "2",
                "user": "throwaway_martinez"
            },
            {
                "id": "commentSellsBodyForGP22",
                "comment": "No one must ever know I dropped my glasses in the toilet. Not I, the man who drafted the Paris Peace Accords.",
                "level": "2",
                "votes": "2",
                "user": "SellsBodyForGP"
            },
            {
                "id": "commentvaughnged1103",
                "comment": "Telephone/SMS network stacks that can't tell you where a call or message came from, allow source numbers to be spoof easily, and have no security mechanisms to prohibit unwanted calls or texts.We already overpay these businesses for their shoddy service. Get with the programme, fuckheads.",
                "level": "1",
                "votes": "103",
                "user": "vaughnged"
            },
            {
                "id": "commentCylonsInAPolicebox22",
                "comment": "Thus no incentive to improve... We already overpay, they know they have people by the balls and they see no need to put forth any effort",
                "level": "2",
                "votes": "2",
                "user": "CylonsInAPolicebox"
            }
        ]
    },
    {
        "id": "what_are_your_favorite_books_of_all_time",
        "title": "What are your favorite books of all time?",
        "votes": "178",
        "link": "https://www.reddit.com/r/AskReddit/comments/v0yvjg/what_are_your_favorite_books_of_all_time/",
        "user": "u/Firm_Priority_1243",
        "comments": [
            {
                "id": "commentmiasabine116",
                "comment": "In no particular order:The Stranger by Albert CamusThe Winter of Discontent by John SteinbeckCatch-22 by Joseph HellerThe Idiot by Fyodor DostoyevskyThe Trial by Franz KafkaCocksure by Mordecai RichlerThe Song of the Red Ruby (Sangen om den røde rubin) by Agnar MykleJonas by Jens Bjørneboe",
                "level": "1",
                "votes": "16",
                "user": "miasabine"
            },
            {
                "id": "commentHealzy4524",
                "comment": "I love The Idiot, but The Brother’s Karamozov will always be my favourite Dostoevsky novel",
                "level": "2",
                "votes": "4",
                "user": "Healzy45"
            },
            {
                "id": "commentmiasabine32",
                "comment": "I’ve read The Brothers Karamazov, but I can’t remember a single thing from it. I was on some heavy medication when I read it so it’s practically wiped from my memory, lol. I really must re-read it.",
                "level": "3",
                "votes": "2",
                "user": "miasabine"
            },
            {
                "id": "commentSuvenPan111",
                "comment": "Treasure island",
                "level": "1",
                "votes": "11",
                "user": "SuvenPan"
            },
            {
                "id": "commentCrazy_Helicopter2015111",
                "comment": "Probably the Sherlock Holmes series. If I had to pick one of them, I’d say The Hound of the Baskervilles",
                "level": "1",
                "votes": "11",
                "user": "Crazy_Helicopter2015"
            },
            {
                "id": "commentBasic-Clock-589522",
                "comment": "The red headed league is my favorite I think!",
                "level": "2",
                "votes": "2",
                "user": "Basic-Clock-5895"
            },
            {
                "id": "commentKingGuy420110",
                "comment": "Outsiders",
                "level": "1",
                "votes": "10",
                "user": "KingGuy420"
            },
            {
                "id": "commentWhatAreWeDoingStudio23",
                "comment": "Probably the only book we had to read on school that I enjoyed",
                "level": "2",
                "votes": "3",
                "user": "WhatAreWeDoingStudio"
            },
            {
                "id": "commentniceguy-365129",
                "comment": "Dark tower series, count of monte Christo",
                "level": "1",
                "votes": "29",
                "user": "niceguy-365"
            },
            {
                "id": "commentPrudentFlamingo211",
                "comment": "The count of Monte Christo is an amazing book, I keep meaning to read it again",
                "level": "2",
                "votes": "11",
                "user": "PrudentFlamingo"
            },
            {
                "id": "commentDragoknights23",
                "comment": "Thankee-sai gunslinger.",
                "level": "2",
                "votes": "3",
                "user": "Dragoknights"
            },
            {
                "id": "commentHalgy32",
                "comment": "Long days and pleasant nights",
                "level": "3",
                "votes": "2",
                "user": "Halgy"
            },
            {
                "id": "commentQualitySquirrel110",
                "comment": "Macbeth by William Shakespeare Animal Farm by George Orwell Cosmos by Carl Sagan They’ll teach us everything we need to know about the world and the people who walk on it.",
                "level": "1",
                "votes": "10",
                "user": "QualitySquirrel"
            },
            {
                "id": "commentJiltedjohn128",
                "comment": "Catch 22Confederacy of DuncesBoth books made me lol on public transport",
                "level": "1",
                "votes": "28",
                "user": "Jiltedjohn"
            },
            {
                "id": "commentwinobot12326",
                "comment": "A confederacy of dunces is so fucking funny. I'm surprised this is the only mention of it in the thread.",
                "level": "2",
                "votes": "6",
                "user": "winobot123"
            },
            {
                "id": "commentDecksxx32",
                "comment": "These 2 books plus john dies at the end are also the only books that have ever made me laugh out loud. I agree confederacy is crazy underrated. Probably the funniest book ever written.",
                "level": "3",
                "votes": "2",
                "user": "Decksxx"
            },
            {
                "id": "commentVictorBlimpmuscle120",
                "comment": "Cat’s Cradle by Kurt VonnegutThe Amazing Adventures of Kavalier and Klay by Michael ChabonCrazy From The Heat - The Autobiography of David Lee Roth",
                "level": "1",
                "votes": "20",
                "user": "VictorBlimpmuscle"
            },
            {
                "id": "commentdust0572Vote",
                "comment": "I love anything by Vonnegut. He’s fantastic",
                "level": "2",
                "votes": "Vote",
                "user": "dust057"
            },
            {
                "id": "commentDazzlingBullfrog921",
                "comment": "Kavalier and Klay is a lifeboat.",
                "level": "2",
                "votes": "1",
                "user": "DazzlingBullfrog9"
            },
            {
                "id": "commentNecessaryReaction794135",
                "comment": "The Hobbit.",
                "level": "1",
                "votes": "35",
                "user": "NecessaryReaction794"
            },
            {
                "id": "commentsetantaslittlehelper150",
                "comment": "Hitchhiker's guide to the galaxy. Dubliners and Mort",
                "level": "1",
                "votes": "50",
                "user": "setantaslittlehelper"
            },
            {
                "id": "commentGamefart101212",
                "comment": "Douglas Adams humour was so ahead of its time, it feels so similar to current internet humour it's uncanny",
                "level": "2",
                "votes": "12",
                "user": "Gamefart101"
            },
            {
                "id": "commentSqueezer_Geezer311",
                "comment": "“You know,” said Arthur, “it’s at times like this, when I’m trapped in a Vogon airlock with a man from Betelgeuse, and about to die of asphyxiation in deep space that I really wish I’d listened to what my mother told me when I was young.”“Why, what did she tell you?”“I don’t know, I didn’t listen.”",
                "level": "3",
                "votes": "11",
                "user": "Squeezer_Geezer"
            },
            {
                "id": "commentbelbites3Vote",
                "comment": "Scientists have calculated that the chance of anything so patently absurd actually existing are millions to one. But magicians have calculated that million-to-one chances crop up nine times out of ten.",
                "level": "3",
                "votes": "Vote",
                "user": "belbites"
            },
            {
                "id": "commentellefred119",
                "comment": "Stephen King-Shining",
                "level": "1",
                "votes": "19",
                "user": "ellefred"
            },
            {
                "id": "commentthepoboy25",
                "comment": "Such an amazing read. I thoroughly enjoyed the sequel as well. I have struggled with alcoholism for many years and they both were just great reads.",
                "level": "2",
                "votes": "5",
                "user": "thepoboy"
            },
            {
                "id": "commentGaryNOVA126",
                "comment": "Sphere by Michael CrichtonDune by Frank HerbertLord of the Rings, and the Hobbit by JRR TolkienHuckleberry Finn, and Tom Sawyer by Mark TwainThe Road by Cormac McCarthyIn Cold Blood by Truman Capote",
                "level": "1",
                "votes": "26",
                "user": "GaryNOVA"
            },
            {
                "id": "commentTisTheWindAndNothing22",
                "comment": "Michael Crichton made great books!",
                "level": "2",
                "votes": "2",
                "user": "TisTheWindAndNothing"
            },
            {
                "id": "commentdust0573Vote",
                "comment": "I feel like he either intentionally wrote for screen adaptations, or there is something inherent about his writing that translates well to film.",
                "level": "3",
                "votes": "Vote",
                "user": "dust057"
            },
            {
                "id": "commentBack2Bach127",
                "comment": "East of Eden",
                "level": "1",
                "votes": "27",
                "user": "Back2Bach"
            },
            {
                "id": "commentPrudentFlamingo26",
                "comment": "One of my favourites. Samuel Hamilton is one of my favourite fictional characrers, so kind and wise.",
                "level": "2",
                "votes": "6",
                "user": "PrudentFlamingo"
            }
        ]
    },
    {
        "id": "whats_a_sign_of_extremely_low_intelligence",
        "title": "What’s a sign of extremely low intelligence?",
        "votes": "",
        "link": "https://www.reddit.com/r/AskReddit/comments/v0cmtb/whats_a_sign_of_extremely_low_intelligence/",
        "user": "u/RecipeNew7219",
        "comments": [
            {
                "id": "commentRichFamiliar9715150k",
                "comment": "Having your hand be bigger than your face",
                "level": "1",
                "votes": "5.0k",
                "user": "RichFamiliar9715"
            },
            {
                "id": "commentChannelistic2165",
                "comment": "slaps",
                "level": "2",
                "votes": "165",
                "user": "Channelistic"
            },
            {
                "id": "commentGenjine00212k",
                "comment": "I was told that means you have cancer 😂",
                "level": "2",
                "votes": "1.2k",
                "user": "Genjine00"
            },
            {
                "id": "commentJoylessMudvillian3533",
                "comment": "In my day it was one of the 'gay tests'",
                "level": "3",
                "votes": "533",
                "user": "JoylessMudvillian"
            },
            {
                "id": "commentAustrianReaper143k",
                "comment": "Equalling contrarianism with intelligence.",
                "level": "1",
                "votes": "4.3k",
                "user": "AustrianReaper"
            },
            {
                "id": "commentJeremy_Winn268",
                "comment": "A lot of people confuse rhetorical questioning and skepticism with critical thinking. Doubting information you don’t like is just the default and framing your doubts as questions is disingenuous.",
                "level": "2",
                "votes": "68",
                "user": "Jeremy_Winn"
            },
            {
                "id": "commentp0lisz216k",
                "comment": "Also, equalling contrarianism with critical reasoning and skepticism",
                "level": "2",
                "votes": "1.6k",
                "user": "p0lisz"
            },
            {
                "id": "commentDollarStoreKanye2727",
                "comment": "Me, as a teenager. Ugh.I'll add on, also.Being unhappy all the time doesn't mean you're deep or smart. Sometimes joy is a far deeper emotion than sadness or anger.",
                "level": "2",
                "votes": "727",
                "user": "DollarStoreKanye"
            },
            {
                "id": "commentKey_River54891178k",
                "comment": "Making strong opinions on topics you don't understand.",
                "level": "1",
                "votes": "17.8k",
                "user": "Key_River5489"
            },
            {
                "id": "comment6pussydestroyer9mlg238k",
                "comment": "Worse when they don't want to admit that they don't know much about it. There are people who admit they are not the most knowledgeable about a topic but will still give their thought.",
                "level": "2",
                "votes": "3.8k",
                "user": "6pussydestroyer9mlg"
            },
            {
                "id": "commentbeluuuuuuga3895",
                "comment": "I hate when they always claim that people hate them because they understand something everyone else does not when actually they're just fucking dumb and spouting bullshit",
                "level": "3",
                "votes": "895",
                "user": "beluuuuuuga"
            },
            {
                "id": "commentMrPundick1207k",
                "comment": "Never changing opinions, even after proven wrong",
                "level": "1",
                "votes": "20.7k",
                "user": "MrPundick"
            },
            {
                "id": "commentMyThrowaway-Thx240k",
                "comment": "It’s easier to fool people than to convince them they’ve been fooled",
                "level": "2",
                "votes": "4.0k",
                "user": "MyThrowaway-Thx"
            },
            {
                "id": "commentPavlock3914",
                "comment": "It's infuriating the number people who are examples of this, sharing it on FB.",
                "level": "3",
                "votes": "914",
                "user": "Pavlock"
            },
            {
                "id": "commentescapingdarwin214k",
                "comment": "It’s hard to win a debate with a smart person, and impossible with a dumb one.",
                "level": "2",
                "votes": "1.4k",
                "user": "escapingdarwin"
            },
            {
                "id": "commentksavage683648",
                "comment": "Don't argue with a dumb one. They'll drag you down to their level and beat you with experience.",
                "level": "3",
                "votes": "648",
                "user": "ksavage68"
            },
            {
                "id": "commentHazed-pixel2247",
                "comment": "And their entire argument is just \"no it isn't\"",
                "level": "2",
                "votes": "247",
                "user": "Hazed-pixel"
            },
            {
                "id": "commentmuzzgg219k",
                "comment": "Why yes the internet is 90% filled with those people",
                "level": "2",
                "votes": "1.9k",
                "user": "muzzgg"
            },
            {
                "id": "commentjews4beer316k",
                "comment": "Think about how dumb the average person is, and then realize that half of humanity is dumber than that.- Carlin",
                "level": "3",
                "votes": "1.6k",
                "user": "jews4beer"
            },
            {
                "id": "commentliteralilliteratekat4658",
                "comment": "The problem with the exercise is that everyone thinks they're the above average half.",
                "level": "4",
                "votes": "658",
                "user": "literalilliteratekat"
            },
            {
                "id": "commentHikamiro5406",
                "comment": "That’s part of the brilliance of the joke",
                "level": "5",
                "votes": "406",
                "user": "Hikamiro"
            },
            {
                "id": "commentMerdin862522",
                "comment": "The final episode of \"Adam Ruins Everything\" actually addressed this. It's extremely common for people to hold tighter to ideas even after being presented with evidence that they are wrong.",
                "level": "2",
                "votes": "522",
                "user": "Merdin86"
            },
            {
                "id": "commentmaddtuck3425",
                "comment": "A lot of internet “debate” isn’t even about people actually exchanging ideas, but figuring out how to dunk on anyone who disagrees. It’s more like a sport/zero sum competition. Sadly the more divisive and inflammatory comments get higher “engagement” and are promoted by the algorithms, especially on places like Twitter and Facebook.",
                "level": "3",
                "votes": "425",
                "user": "maddtuck"
            },
            {
                "id": "commentHyndis4360",
                "comment": "Reddit isn't immune to that. People pile upvotes and awards on things they would like to be true and pile downvotes on anything that the group would prefer not to be true, even if its factually correct. The hype train cannot be stopped once started, creating echo chambers.",
                "level": "4",
                "votes": "360",
                "user": "Hyndis"
            },
            {
                "id": "commentbushpotatoe2265",
                "comment": "I'd argue pride has a significant impact on this type of decision making.",
                "level": "2",
                "votes": "265",
                "user": "bushpotatoe"
            },
            {
                "id": "commentThe_Crescent3214",
                "comment": "Well that and the fact that we tend to pile on when someone is wrong, I can see why someone would fight tooth and nail to avoid that scrutiny of everyone shaming them for having a wrong opinion on something",
                "level": "3",
                "votes": "214",
                "user": "The_Crescent"
            },
            {
                "id": "commentDognamedvelvet450",
                "comment": "Good observation",
                "level": "4",
                "votes": "50",
                "user": "Dognamedvelvet"
            },
            {
                "id": "commentTotallycasual1302k",
                "comment": "Inability to take new information onboard and change your position on subjects.",
                "level": "1",
                "votes": "30.2k",
                "user": "Totallycasual"
            },
            {
                "id": "commentGameShill247k",
                "comment": "Pretty much all intelligence actually takes. Keep on rolling that metaphorical Katamari.",
                "level": "2",
                "votes": "4.7k",
                "user": "GameShill"
            },
            {
                "id": "commentjupiterLILY320k",
                "comment": "Yeah, intelligence is literally the ability to acquire and apply knowledge.",
                "level": "3",
                "votes": "2.0k",
                "user": "jupiterLILY"
            },
            {
                "id": "commentDeadAntivaxxersLOL229k",
                "comment": "this one is hilarious because its always the top comment to these questions. but reddit probably reads it and thinks not being able to persuade someone is the same thing. you know for a fact people on both sides of a controversial topic will upvote this comment while thinking about their adversary.\"I couldn't convince someone to agree with me on this--that's how I know they have low intelligence.\"",
                "level": "2",
                "votes": "2.9k",
                "user": "DeadAntivaxxersLOL"
            }
        ]
    },
    {
        "id": "whats_something_democrats_and_republicans_100",
        "title": "What's something Democrats and Republicans 100% agree on?",
        "votes": "44",
        "link": "https://www.reddit.com/r/AskReddit/comments/v13vzi/whats_something_democrats_and_republicans_100/",
        "user": "u/Reddit807",
        "comments": [
            {
                "id": "commentDrChefAstronaut1232",
                "comment": "They should should be re-elected",
                "level": "1",
                "votes": "232",
                "user": "DrChefAstronaut"
            },
            {
                "id": "commentLeonard_Van_Vee213",
                "comment": "This legit made me laugh out loud",
                "level": "2",
                "votes": "13",
                "user": "Leonard_Van_Vee"
            },
            {
                "id": "commentACMilanIndy34",
                "comment": "Sad part is it’s accurate",
                "level": "3",
                "votes": "4",
                "user": "ACMilanIndy"
            },
            {
                "id": "commentcheesefondue210",
                "comment": "I’m not a politician and even I do things to keep my job",
                "level": "2",
                "votes": "10",
                "user": "cheesefondue"
            },
            {
                "id": "commentAezetyr22",
                "comment": "This is the best answer.",
                "level": "2",
                "votes": "2",
                "user": "Aezetyr"
            },
            {
                "id": "commentantiquasi2Vote",
                "comment": "and we are willing to lie, cheat, and or steal to do so.",
                "level": "2",
                "votes": "Vote",
                "user": "antiquasi"
            },
            {
                "id": "commentGrisward2Vote",
                "comment": "Yes.Also it also isn’t just re-election that’s the problem, someone mentioned “job security” but it isn’t that. It’s more like gaining job security from people who aren’t the ones paying your salary. It isn’t from the government or even the voters.Ultimately this is the seed of corruption.Re-election funding causes politicians not to act for their constituents but for whoever offers the most benefit (which usually but not always means funds) in re-election. Thus lobbyists, PACs, large funding groups, big endorsements (NRA), etc. A huge endorsement can mean as much as millions in election financing, and cowering to these groups substantially reduces the power of our votes.Once politicians stop acting for their constituents, all is lost.",
                "level": "2",
                "votes": "Vote",
                "user": "Grisward"
            },
            {
                "id": "commenttommy3rd198",
                "comment": "when voting to raise their salaries.",
                "level": "1",
                "votes": "98",
                "user": "tommy3rd"
            },
            {
                "id": "commentchacham2214",
                "comment": "Hence the 27th amendment:",
                "level": "2",
                "votes": "14",
                "user": "chacham2"
            },
            {
                "id": "commenttommy3rd38",
                "comment": "win a second term, get the raise you voted for. sounds like a plan.",
                "level": "3",
                "votes": "8",
                "user": "tommy3rd"
            },
            {
                "id": "commentchacham24Vote",
                "comment": "Yes, but you need to get elected with people knowing that you raised your own salary. Things like that tend not to go down well.Senate Salaries since 1789 shows both ups and downs, the last increase being in 2009.House Salaries aren't much different.",
                "level": "4",
                "votes": "Vote",
                "user": "chacham2"
            },
            {
                "id": "commentExplosiveDisassembly3Vote",
                "comment": "Funny thing. This amendment took over 200 years to ratify and take effect, but was initially proposed with the first 10.",
                "level": "3",
                "votes": "Vote",
                "user": "ExplosiveDisassembly"
            },
            {
                "id": "commentvriesdejelmer4Vote",
                "comment": "Oio",
                "level": "4",
                "votes": "Vote",
                "user": "vriesdejelmer"
            },
            {
                "id": "commentRRuruurrr193",
                "comment": "They both seem to like money.",
                "level": "1",
                "votes": "93",
                "user": "RRuruurrr"
            },
            {
                "id": "comment-1",
                "comment": "",
                "level": -1,
                "votes": "",
                "user": ""
            },
            {
                "id": "comment-1",
                "comment": "",
                "level": -1,
                "votes": "",
                "user": ""
            },
            {
                "id": "commentgentlemancaller2000181",
                "comment": "The other side is evil and wants to ruin the country",
                "level": "1",
                "votes": "81",
                "user": "gentlemancaller2000"
            },
            {
                "id": "commentPepe_Frogger221",
                "comment": "thats just their public-speak.they are all part of the same club.",
                "level": "2",
                "votes": "21",
                "user": "Pepe_Frogger"
            },
            {
                "id": "commentgentlemancaller2000312",
                "comment": "I like to say “same trough, different pigs”",
                "level": "3",
                "votes": "12",
                "user": "gentlemancaller2000"
            },
            {
                "id": "commentkickspecialist4Vote",
                "comment": "My co-worker was messing with me about getting vaccinated and he called me a sheep. I said “just a different flock bud.” I think his mind stopped working for five seconds.",
                "level": "4",
                "votes": "Vote",
                "user": "kickspecialist"
            },
            {
                "id": "commentAMerrickanGirl5Vote",
                "comment": "Ask him this. If he’s not a sheep, what is one thing he doesn’t agree with the Republicans, anti-vax, Quanon or whatever. If he can’t find one issue where he deviates from the party line, then he’s a sheep.",
                "level": "5",
                "votes": "Vote",
                "user": "AMerrickanGirl"
            },
            {
                "id": "commentPiggus_Porkus_2-4",
                "comment": "Honestly they were both fuck up the country. I don’t care which one wins, in the end, they will both destroy America",
                "level": "2",
                "votes": "-4",
                "user": "Piggus_Porkus_"
            },
            {
                "id": "commentGooberBandini1138310",
                "comment": "bOtH sIdEs!",
                "level": "3",
                "votes": "10",
                "user": "GooberBandini1138"
            },
            {
                "id": "commentthrowaway5272410",
                "comment": "Pretending both sides are equally at fault is how we signal that we're smarter than either side, you see.",
                "level": "4",
                "votes": "10",
                "user": "throwaway5272"
            },
            {
                "id": "commentomegasix3215Vote",
                "comment": "They don't have to be equally at fault. Just because one party is shittier than the other doesn't mean they aren't both shitty. The lesser of two evils is still evil.",
                "level": "5",
                "votes": "Vote",
                "user": "omegasix321"
            },
            {
                "id": "commentPoultryblender33",
                "comment": "Even if a side doesn’t specifically ruin America, the arguments and fights between the two parties sure as hell will.",
                "level": "3",
                "votes": "3",
                "user": "Poultryblender"
            },
            {
                "id": "commentNotsogrumpyoldman32",
                "comment": "A bunch of adult toddlers pointing the shit end of the stick at one another.",
                "level": "3",
                "votes": "2",
                "user": "Notsogrumpyoldman"
            },
            {
                "id": "commentthe_ymcalolv341",
                "comment": "Also they get paid very well.",
                "level": "4",
                "votes": "1",
                "user": "the_ymcalolv3"
            },
            {
                "id": "commentShakespurious126",
                "comment": "Can't stand those neutrals!",
                "level": "1",
                "votes": "26",
                "user": "Shakespurious"
            },
            {
                "id": "commentbguzewicz214",
                "comment": "I hate these filthy Neutrals, Kif. With enemies you know where they stand but with Neutrals, who knows? It sickens me.",
                "level": "2",
                "votes": "14",
                "user": "bguzewicz"
            },
            {
                "id": "commentBillMueller26",
                "comment": "Tell my wife \"hello.\"",
                "level": "2",
                "votes": "6",
                "user": "BillMueller"
            }
        ]
    },
    {
        "id": "what_tourist_attraction_actually_lives_up_to_its",
        "title": "What tourist attraction actually lives up to its reputation?",
        "votes": "474",
        "link": "https://www.reddit.com/r/AskReddit/comments/v0pjxa/what_tourist_attraction_actually_lives_up_to_its/",
        "user": "u/eveisshady777",
        "comments": [
            {
                "id": "commentvswlife1117",
                "comment": "Cliffs of Moher",
                "level": "1",
                "votes": "117",
                "user": "vswlife"
            },
            {
                "id": "commentieatsocksbitch217",
                "comment": "I once walked them in a storm wearing shorts, we had a Spanish guy over that was mocking us for wearing shorts in shitty weatherHe wore jeans(We stayed away from the edge, made sure we never put ourselves in a dangerous position, turned back when the youngest couldn’t really handle the weather anymore)",
                "level": "2",
                "votes": "17",
                "user": "ieatsocksbitch"
            },
            {
                "id": "commentSilenceFall211",
                "comment": "Just avoid getting there through the scenic boat route via Aran Islands. Me and my friends did that and pretty much the whole boat got seasick and by the time I had a view of the cliffs everyone around me was vomiting into a plastic bag that the boat crew was handing out (like they were so ready that every crewmember had a bag of plastic bags on them).But once we got to the actual cliffs it was beautiful.",
                "level": "2",
                "votes": "11",
                "user": "SilenceFall"
            },
            {
                "id": "commentDeathangel289025",
                "comment": "Absolutely breathtaking place. Loved seeing it.",
                "level": "2",
                "votes": "5",
                "user": "Deathangel2890"
            },
            {
                "id": "commentMIBlackburn1102",
                "comment": "British Museum if you like your history.Never went until I was in my early 20s, the sheer amount of stuff in there is incredible. I've been about a dozen times now Kings Cross station isn't that far from it so I visit for three or so hours before my train from London. I still haven't seen everything on display in there. While everyone crowds around the same few pieces like the Rosetta Stone, there are fascinating pieces that get a quick glance while walking by towards something bigger.",
                "level": "1",
                "votes": "102",
                "user": "MIBlackburn"
            },
            {
                "id": "commentother_usernames_gone238",
                "comment": "Same with the London science museum and the natural history museum.You literally don't have time to see everything in there in a day.",
                "level": "2",
                "votes": "38",
                "user": "other_usernames_gone"
            },
            {
                "id": "commentMIBlackburn317",
                "comment": "V&A and National Gallery too.You can easily not spend any money on attractions in London for a bunch of wonders from the UK and around the world which compensates for the food prices.Or you can spend lots of money on a giant wheel, dummies and severed head dummies which are all owned by the same company.",
                "level": "3",
                "votes": "17",
                "user": "MIBlackburn"
            },
            {
                "id": "commentBigpdean215",
                "comment": "And it’s completely free",
                "level": "2",
                "votes": "15",
                "user": "Bigpdean"
            },
            {
                "id": "commentItchy-Oil-27411798",
                "comment": "The Grand Canyon, no matter what you expect it’s still jaw dropping",
                "level": "1",
                "votes": "798",
                "user": "Itchy-Oil-2741"
            },
            {
                "id": "commentaltera_goodciv2302",
                "comment": "“Crying: acceptable at funerals and the Grand Canyon.” - Ron Swanson",
                "level": "2",
                "votes": "302",
                "user": "altera_goodciv"
            },
            {
                "id": "commentEchoSlammaJamma322390",
                "comment": "\"Where are the faces of the presidents?\"",
                "level": "3",
                "votes": "90",
                "user": "EchoSlammaJamma322"
            },
            {
                "id": "commentalwysonthatokiedokie3136",
                "comment": "I cried when I saw it. Then we went back at night and I cried when I saw the galaxy in the sky for the first time.",
                "level": "3",
                "votes": "136",
                "user": "alwysonthatokiedokie"
            },
            {
                "id": "commentstryph42455",
                "comment": "Y'know, I sometimes forget that other people live in places where when you look up at night you don't see all the stuff that's up there. Thanks for the reminder that that's something I should appreciate.",
                "level": "4",
                "votes": "55",
                "user": "stryph42"
            },
            {
                "id": "commentAMerrickanGirl313",
                "comment": "I loved the P & R episode where April and Andy go to the Grand Canyon.Andy: It's so much more beautiful than I ever could have imagined.\nApril: Yeah, I'm trying to find a way to be annoyed at it, but I'm coming up empty.\nAndy: Where are all the faces... of the presidents?",
                "level": "3",
                "votes": "13",
                "user": "AMerrickanGirl"
            },
            {
                "id": "commentHeadGivingMan233",
                "comment": "Unless you visit it on a foggy day like I did",
                "level": "2",
                "votes": "33",
                "user": "HeadGivingMan"
            },
            {
                "id": "commentConsultantForLife374",
                "comment": "My wife and I made canyon facing hotel reservations many months in advance. We got in after dark the night we checked in.The next morning she said \"I can't wait to see this!\" and flung the curtains open ...to see heavy fog and light snow.It cleared after a couple hours and that place is amazing.",
                "level": "3",
                "votes": "74",
                "user": "ConsultantForLife"
            },
            {
                "id": "commentAnAquaticOwl324",
                "comment": "There's a very famous church, surrounded by mountains, in Georgia. I first went there in 2017 - I arrived at the town, got a great view of the churches lights from a distance at night, and then when I hiked up to it the next day the whole area was blanketed in a fog so thick you couldn't see the church unless you were standing three feet from it. I waited for a while for the fog to lift, but it didn't. So I hiked back down in near zero visibility, trying not to die. Shortly after reaching the bottom the fog cleared.I went back last December. Completely different time of year. This time the fog wasn't that thick - you could see the church from a couple hundred feet away...but the landscape was still cloaked in it and it was impossible to see the dramatic mountains that surround it.But hey, speaking of the Grand Canyon I was actually supposed to go recently. But then I got hit by a car and I missed it. We can't have everything, right? 🤷",
                "level": "3",
                "votes": "24",
                "user": "AnAquaticOwl"
            },
            {
                "id": "commentSpookyYurt439",
                "comment": "Sounds like you can't have anything.",
                "level": "4",
                "votes": "39",
                "user": "SpookyYurt"
            },
            {
                "id": "commentAnAquaticOwl528",
                "comment": "That is how the last few years have gone, yeah. Every time I make plans something catastrophic happens.I make a plan to spend five years traveling the world BAM pandemicI finally book a trip to Afghanistan - a place I've been wanting to go for years BAM the US military pulls out the day of my flight and the country collapsesI finally get a three year visa to Russia and make a plan to spend three years there BAM they invade UkraineI try to make up for it by cycling cross country, at the end of which I'll finally see one of my favorite bands in concert, in addition to getting to finally explore a part of the country I've been wanting to see for years BAM I get hit by a car the day before I would finally reach the area I was most looking forward to and then BAM I finally get to my end destination and find out the day of that the concerts been cancelled.Such is life though, eh? I've got a trip planned to CAR and South Sudan in August, I'm fully expecting one of them to invade the other amidst a sudden ebola outbreak in July.",
                "level": "5",
                "votes": "28",
                "user": "AnAquaticOwl"
            },
            {
                "id": "commentCylonsInAPolicebox654",
                "comment": "So I'm going to put this as nice as possible... Quit planning trips, you obviously have some kind of ancient curse or something, perhaps you pissed off Hermes. Go carry Madame Zeroni up the mountain.",
                "level": "6",
                "votes": "54",
                "user": "CylonsInAPolicebox"
            },
            {
                "id": "commentthred_pirate_roberts712",
                "comment": "This is the only appropriate response.",
                "level": "7",
                "votes": "12",
                "user": "thred_pirate_roberts"
            },
            {
                "id": "commentdarkbee83612",
                "comment": "I didn't know it was possible to have a LUCK stat in the negatives.",
                "level": "6",
                "votes": "12",
                "user": "darkbee83"
            },
            {
                "id": "commentthred_pirate_roberts64",
                "comment": "I'm sure there's a way to make bank off of this...",
                "level": "6",
                "votes": "4",
                "user": "thred_pirate_roberts"
            },
            {
                "id": "commenti_hateeveryone236",
                "comment": "110% I’m not a outdoor person at all or into visiting nature related places.But I gasp when I saw the Grand Canyon.Movies and tv shows never depict how big and majestic it really is.It’s amazing and the colors are vivid.",
                "level": "2",
                "votes": "36",
                "user": "i_hateeveryone"
            },
            {
                "id": "commentvellyr210",
                "comment": "I thought it would be a geographical feature, like a mountain but upside-down, but it’s a whole damn region.",
                "level": "2",
                "votes": "10",
                "user": "vellyr"
            },
            {
                "id": "commentCapable_Challenge_6226",
                "comment": "Lol I was just about to say that. I've been 2 times and it's the most beautiful place. I'm planning on hiking down it one day.",
                "level": "2",
                "votes": "6",
                "user": "Capable_Challenge_62"
            },
            {
                "id": "commentValhallallama311",
                "comment": "Make sure it’s not on the hottest day of the year like I did. There were groups of us huddled in the few shade spots across the path like it was a damn video game and we took damage outside of the shade",
                "level": "3",
                "votes": "11",
                "user": "Valhallallama"
            },
            {
                "id": "commentgobbledgood26",
                "comment": "Sounds like I better see the Grand Canyon then",
                "level": "2",
                "votes": "6",
                "user": "gobbledgood"
            },
            {
                "id": "commentthecorinnethian26",
                "comment": "Yep. The views reduced me to a dithering fool. All I could say the whole time I was there was, \"The Grand Canyon is very grand indeed.\" lol",
                "level": "2",
                "votes": "6",
                "user": "thecorinnethian"
            },
            {
                "id": "commentscottwax213",
                "comment": "It's like when you go to a ballpark and walk up the concourse and see the field. Only like x 1000.My sons and I were there this summer. It's absolutely magnificent no matter how many times I've been there. And for my adult kids, it was their first time.",
                "level": "2",
                "votes": "13",
                "user": "scottwax"
            },
            {
                "id": "commentJaygrow225",
                "comment": "Came here to say this. Glad it was posted basically immediately.",
                "level": "2",
                "votes": "25",
                "user": "Jaygrow"
            }
        ]
    },
    {
        "id": "atheists_of_reddit_what_could_change_your_mind",
        "title": "Atheists of Reddit: What could change your mind?",
        "votes": "",
        "link": "https://www.reddit.com/r/AskReddit/comments/v09mmi/atheists_of_reddit_what_could_change_your_mind/",
        "user": "u/Graysie-Redux",
        "comments": [
            {
                "id": "commentserharridan175k",
                "comment": "Every single paedophile/rapist in religious positions of power being simultaneously struck by lightning",
                "level": "1",
                "votes": "7.5k",
                "user": "serharridan"
            },
            {
                "id": "commentAmataretsublack2724",
                "comment": "I like this one",
                "level": "2",
                "votes": "724",
                "user": "Amataretsublack"
            },
            {
                "id": "commentHypersapien2419",
                "comment": "Or political positions of power.Or corporate, for that matter.",
                "level": "2",
                "votes": "419",
                "user": "Hypersapien"
            },
            {
                "id": "commentRobyk113148",
                "comment": "Or any pedophile that actually acts on their urges.",
                "level": "3",
                "votes": "148",
                "user": "Robyk11"
            },
            {
                "id": "commentKlebefieber166k",
                "comment": "Evidence.",
                "level": "1",
                "votes": "6.6k",
                "user": "Klebefieber"
            },
            {
                "id": "commentRdr198829223k",
                "comment": "Yep. Any actual evidence. Also change my mind about which god(s)? Yahweh, Zeus, Osiris, Amaterasu?I'm always amused by people not understanding what athiesm is. Its not a belief. Its a rejection of a claim and thats it. Its not what evidence would convince me otherwise, its what evidence do you have. I observe said evidence and say thats not sufficient evidence because...Edit: spelling because i is stupid",
                "level": "2",
                "votes": "2.3k",
                "user": "Rdr198829"
            },
            {
                "id": "commentMr__Monotone3481",
                "comment": "To branch off of this, there would also need to be proof that other gods dont exist for all the mono religions. Like explain why ancient mythology is well myths, but not current day religion.",
                "level": "3",
                "votes": "481",
                "user": "Mr__Monotone"
            },
            {
                "id": "commentthebraken3425",
                "comment": "I think the heart of OP's question is really \"what would be sufficient evidence for you?\"Like, something I might find to be compelling evidence might make you shrug - and vice versa.",
                "level": "3",
                "votes": "425",
                "user": "thebraken"
            },
            {
                "id": "commentPRGuyHere111k",
                "comment": "My dad is an atheist, and had a major heart attack last year which came extremely close to killing him many times. He was in a coma for more than a month.During that time, several Christian family members wondered if he was having a religious experience, had seen/spoken to god or maybe his late daughter as an angel, and would awake as a religious man now.I said there was zero chance. Even if he did actually have these experiences and then come out of the coma and tell us about them, he would never say “I talked to god while I was in a coma.” He would say “The chemicals in my brain did an interesting thing while I was in a coma.”As it happened, he did live and was able to tell us about his experience. None of it was remotely religious. It was mostly memories of thinking the hospital staff were torturing him.The closest thing he had during the coma was a dream where he saw my wife telling him that my dead sister and my wife’s dead sister were talking in heaven.",
                "level": "1",
                "votes": "1.1k",
                "user": "PRGuyHere"
            },
            {
                "id": "commentOxenkopf2272",
                "comment": "Possibly of interest: one of our millionaire businessmen Kerry Packer had a major heart attack. Local ambulance crew had a defibrillator and brought him back to life. IIRC someone asked him \"What's on the other side?\" and he replied \"Bloody nothing!\"",
                "level": "2",
                "votes": "272",
                "user": "Oxenkopf"
            },
            {
                "id": "commentOxenkopf328",
                "comment": "Ah, here it is: https://ffrf.org/ftod-cr/item/14908-kerry-packer",
                "level": "3",
                "votes": "28",
                "user": "Oxenkopf"
            },
            {
                "id": "commentaccount_not_valid462",
                "comment": "",
                "level": "4",
                "votes": "62",
                "user": "account_not_valid"
            },
            {
                "id": "commentkunoichhia295",
                "comment": "I got crushed in a massive accident 2 years ago. Woke up after a 5 day coma, believe me there is no light, tunnel, no movie playing in your head. It's just a quick moment in your head damn this is a stupid way to die and lights out!",
                "level": "2",
                "votes": "95",
                "user": "kunoichhia"
            },
            {
                "id": "commentXyrus2000320",
                "comment": "Similar experience. When I was a kid I had a severe allergy to bee stings. I got stung and went into cardiac arrest.The closest thing I can compare the experience to is a light switch. You're there, and then you're not. There is no gentle floating. There is no light. There is no awareness. It's literally like you get turned off.It's really hard to convey what that's like to someone who's never had that happen before.",
                "level": "3",
                "votes": "20",
                "user": "Xyrus2000"
            },
            {
                "id": "commentKMMM__279",
                "comment": "Wow. Very interesting. Thanks for sharing this.",
                "level": "2",
                "votes": "79",
                "user": "KMMM__"
            },
            {
                "id": "commentRedofPaw163k",
                "comment": "\"Christians, what would convince you to worship the Egyptian god Ra?\"",
                "level": "1",
                "votes": "6.3k",
                "user": "RedofPaw"
            },
            {
                "id": "commentRikenVorkovin2946",
                "comment": "Whichever one, Christ or Ra, shows up in front of me first and bitch slaps me.Edit: if one of you offering to slap me are a God please teleport to my location to prove it you coward.",
                "level": "2",
                "votes": "946",
                "user": "RikenVorkovin"
            },
            {
                "id": "commentSinkPhaze3167",
                "comment": "Not even sure that'd be enough. What's more likely? An actual God or aliens trolling us for shits and giggles?",
                "level": "3",
                "votes": "167",
                "user": "SinkPhaze"
            },
            {
                "id": "commentsamskyyy215k",
                "comment": "Jesus may have died for your sins, but Ra rules over all the underworld and overworld and has never died.",
                "level": "2",
                "votes": "1.5k",
                "user": "samskyyy"
            },
            {
                "id": "commentTheJarJarExp3796",
                "comment": "Ra actually dies every night. It’s central to the Amduat and the Book of Gates",
                "level": "3",
                "votes": "796",
                "user": "TheJarJarExp"
            },
            {
                "id": "commentGinDawg4130",
                "comment": "There's \"death\" and then there's \"death\". The two are not the same.",
                "level": "4",
                "votes": "130",
                "user": "GinDawg"
            },
            {
                "id": "commentTheJarJarExp526",
                "comment": "Sure, except the symbolism used is Ra uniting with Osiris, which was imagery used for when regular people died too",
                "level": "5",
                "votes": "26",
                "user": "TheJarJarExp"
            },
            {
                "id": "commentdmatson7242886",
                "comment": "Ra-ra-ah-ah-ah. Roma-roma-ma. Gaga, \"Ooh la-la\"",
                "level": "2",
                "votes": "886",
                "user": "dmatson724"
            },
            {
                "id": "commentTamias-striatus3430",
                "comment": "You just converted me",
                "level": "3",
                "votes": "430",
                "user": "Tamias-striatus"
            },
            {
                "id": "commentV3N0M0U5_V1P3R425",
                "comment": "Lol your comment fits the song perfectly actually, if you read the first and yours together",
                "level": "4",
                "votes": "25",
                "user": "V3N0M0U5_V1P3R"
            },
            {
                "id": "commentGoddessOfDivinity353",
                "comment": "Wanchobaromanz",
                "level": "3",
                "votes": "53",
                "user": "GoddessOfDivinity"
            },
            {
                "id": "commentThundaCrossSplitAtak124k",
                "comment": "As a former atheist, what changed my mind was that, i learned the flying spaghetti monster existed.",
                "level": "1",
                "votes": "2.4k",
                "user": "ThundaCrossSplitAtak"
            },
            {
                "id": "commentAn_Atheist_God221k",
                "comment": "R'amen",
                "level": "2",
                "votes": "2.1k",
                "user": "An_Atheist_God"
            },
            {
                "id": "commentNaughtSleeping3499",
                "comment": "Pasta be thy name",
                "level": "3",
                "votes": "499",
                "user": "NaughtSleeping"
            },
            {
                "id": "commentYoungBeef034230",
                "comment": "Thy kingdom come, Al Dente done",
                "level": "4",
                "votes": "230",
                "user": "YoungBeef03"
            },
            {
                "id": "commentBoJackB263545110",
                "comment": "on top some grated Parmesan.",
                "level": "5",
                "votes": "110",
                "user": "BoJackB26354"
            }
        ]
    },
    {
        "id": "whats_a_subtle_sign_that_someone_had_a_rough",
        "title": "What's a subtle sign that someone had a rough childhood?",
        "votes": "78",
        "link": "https://www.reddit.com/r/AskReddit/comments/v0xmte/whats_a_subtle_sign_that_someone_had_a_rough/",
        "user": "u/Accomplished_Bird721",
        "comments": [
            {
                "id": "commentHarestius1169",
                "comment": "When they talk about very rough stuff they do it as if it's a normal topic, without noticable emotions.They dismantle, avoid or opt out of every emotionally involving situation.Their behavior will be stable for a while with drastic change every now and then.",
                "level": "1",
                "votes": "169",
                "user": "Harestius"
            },
            {
                "id": "commentwhitefrog24249",
                "comment": "I do all of this. I used to have friends come to me and tell me that talking about my childhood made them uncomfortable. They never wanted to visit my house, either. I never understood why and thought that I was just annoying. Turns out that what happened to me on a regular basis is pretty graphic for the average person who had a solid relationship with their family. I just thought it was normal.",
                "level": "2",
                "votes": "49",
                "user": "whitefrog24"
            },
            {
                "id": "commentHarestius38",
                "comment": "I'm pretty much the same too.",
                "level": "3",
                "votes": "8",
                "user": "Harestius"
            },
            {
                "id": "comment-1",
                "comment": "",
                "level": -1,
                "votes": "",
                "user": ""
            },
            {
                "id": "commentBunBunny_draws26",
                "comment": "Ah, that's not me, no, I wasn't just described by a reandom redditor, noooo",
                "level": "2",
                "votes": "6",
                "user": "BunBunny_draws"
            },
            {
                "id": "comment-1",
                "comment": "",
                "level": -1,
                "votes": "",
                "user": ""
            },
            {
                "id": "commentGloomy-Tradition694193",
                "comment": "isolationover -explaining or -apologizingjob hoppingpeople pleasingexaggerated emotional responsessubstance abuse or other toxic coping mechanisms (food, thrills)",
                "level": "1",
                "votes": "93",
                "user": "Gloomy-Tradition694"
            },
            {
                "id": "commentNo_Regrats_42214",
                "comment": "Id be mad at you for pointing out my flaws but I don't want to make you mad at me so I'll just agree. Says the guy still sitting in bed on his day off looking at Reddit because I can be social....on my time",
                "level": "2",
                "votes": "14",
                "user": "No_Regrats_42"
            },
            {
                "id": "commentMacluawn2Vote",
                "comment": "No, not like this",
                "level": "2",
                "votes": "Vote",
                "user": "Macluawn"
            },
            {
                "id": "commentGloomy-Tradition6943Vote",
                "comment": "Why not?",
                "level": "3",
                "votes": "Vote",
                "user": "Gloomy-Tradition694"
            },
            {
                "id": "commentSoul-Seeker722",
                "comment": "Sudden realisation here.",
                "level": "2",
                "votes": "2",
                "user": "Soul-Seeker7"
            },
            {
                "id": "commentdirtyoldmikegza21",
                "comment": "I feel seen...or attacked...or both...",
                "level": "2",
                "votes": "1",
                "user": "dirtyoldmikegza"
            },
            {
                "id": "commentzurzoth21",
                "comment": "Damn, Ime doing / got all this but the exaggerated emotional responses... I just cutted myself from feeling. It's much easier.",
                "level": "2",
                "votes": "1",
                "user": "zurzoth"
            },
            {
                "id": "commentGloomy-Tradition6943Vote",
                "comment": "Trauma (and we tend to minimize) leads you to develop coping skills that can turn toxic in the long term. The exaggerated emotional responses aren't constant, they're part of being triggered to a flight, fight, freeze, or fawn survival response. Some people end up in jail, or crippled with shame, or worse.A cPTSD diagnosis helped me find tools to heal some, and there's a few subreddits. Just learning to ground myself throughout the day and doing inner child work has made a massive difference - I'm not constantly spun up or stuck. I've gotten some relief from toxic shame and the inner critic too.",
                "level": "3",
                "votes": "Vote",
                "user": "Gloomy-Tradition694"
            },
            {
                "id": "commentDoctor_Oceanblue4Vote",
                "comment": "Please stay away from r/cptsd, there are a lot of people there who are anti-therapy",
                "level": "4",
                "votes": "Vote",
                "user": "Doctor_Oceanblue"
            },
            {
                "id": "commentDashthefox2Vote",
                "comment": "Maybe I DID have a rough childhood.",
                "level": "2",
                "votes": "Vote",
                "user": "Dashthefox"
            },
            {
                "id": "commentKerraferto151",
                "comment": "You see a drink/smoke constantly in their hand every time they go out.Good humor, on the offensive side.Serious face, often lack of eye contact.Explosive temper.Jealously protective over their friends/things. Will make a scene or punch someone to defend, even if the situation didn't call for it.Seemingly calm and collected under skin-crawling scenarios.Talking about rough subjects with a casual face and tone.Not leaving the house much.",
                "level": "1",
                "votes": "51",
                "user": "Kerraferto"
            },
            {
                "id": "commentSnowfreak2507213",
                "comment": "The only thing I don’t agree with is the “punching someone when the scenario didn’t call for it.” One thing having a rough childhood taught me, is when it’s fight time. I am non confrontational for the most part, but In any situation I can tell the exact moment I need to start defending myself, once someone puts their hands on you, like a solid shove, is a good indicator the fight has started. Winning fights in a rough neighborhood usually means throwing the first punch when you see the scenario escalate to a certain degree.",
                "level": "2",
                "votes": "13",
                "user": "Snowfreak2507"
            },
            {
                "id": "commentNikcara37",
                "comment": "Nothing listed in this thread is going to describe every person who had a rough childhood. Everyone responds to their trauma in their own way, and no one rough childhood is completely like anyone else’s. So all of these signs will apply to some people and not others.",
                "level": "3",
                "votes": "7",
                "user": "Nikcara"
            },
            {
                "id": "commentSnowfreak250741",
                "comment": "Yea I guess your probably right.",
                "level": "4",
                "votes": "1",
                "user": "Snowfreak2507"
            },
            {
                "id": "commentAsad_1321",
                "comment": "Jesus Christ.",
                "level": "2",
                "votes": "1",
                "user": "Asad_13"
            },
            {
                "id": "commentCockatielmaster692Vote",
                "comment": "the only box i don't check is the temper",
                "level": "2",
                "votes": "Vote",
                "user": "Cockatielmaster69"
            },
            {
                "id": "commentPale_Consideration_21115",
                "comment": "Following rules to the point of anxiety",
                "level": "1",
                "votes": "115",
                "user": "Pale_Consideration_2"
            },
            {
                "id": "commentMoag14231",
                "comment": "This is me. I came to realize that it’s because I’d get the shit beat out of me as a kid if I didn’t. Now as an adult I literally get anxiety attacks if something is not done by the book.",
                "level": "2",
                "votes": "31",
                "user": "Moag14"
            },
            {
                "id": "commentPale_Consideration_235",
                "comment": "I’m very sorry you experienced this. My dad is exactly this way, he was upbeat by his parents and now I feel bad for the poor guy. He explained and tries his best not to reflect such behaviour but unfortunately does so subconsciously. Instead of physical abuse it was verbal / mental",
                "level": "3",
                "votes": "5",
                "user": "Pale_Consideration_2"
            },
            {
                "id": "commentMassive-Ad7628135",
                "comment": "serious distrust or hatred for men",
                "level": "1",
                "votes": "35",
                "user": "Massive-Ad7628"
            },
            {
                "id": "commentNikcara218",
                "comment": "Or women, if their mother was their abuser. I’ve seen both.",
                "level": "2",
                "votes": "18",
                "user": "Nikcara"
            },
            {
                "id": "commentyeetgodmcnechass310",
                "comment": "My mom has abused me for my entire life. I didn't realize it until I was in college. At the same time I started watching commentary youtubers. Unfortunately most of them were borderline or sometimes outright misogynistic/incelish. For a while I hated women, until I made friends with women who weren't a piece of shit. If I didn't meet them when I did I might've gone down the incel rabbit hole",
                "level": "3",
                "votes": "10",
                "user": "yeetgodmcnechass"
            },
            {
                "id": "commentMerry_Dankmas3Vote",
                "comment": "Jokes on you, I hate both men and women. My disdain for others is equal opportunity.",
                "level": "3",
                "votes": "Vote",
                "user": "Merry_Dankmas"
            },
            {
                "id": "commentMassive-Ad76283Vote",
                "comment": "true,\nthough I'm not necessarily saying that a father was the abuser.\nstatistically speaking... ughh.. and I hate myself for saying it, but statistically speaking, sexual abusers of children are where men are in an extreme majority - and we're to shut up and ignore all shit that we see or notice,\nno matter what it is because of traditions of the Gender War",
                "level": "3",
                "votes": "Vote",
                "user": "Massive-Ad7628"
            },
            {
                "id": "commentNot_Jim3194",
                "comment": "Will agree with things they don't believe to avoid the argument.",
                "level": "1",
                "votes": "94",
                "user": "Not_Jim3"
            }
        ]
    },
    {
        "id": "if_you_had_to_guess_how_will_you_die",
        "title": "If you had to guess, how will you die?",
        "votes": "24",
        "link": "https://www.reddit.com/r/AskReddit/comments/v13r6d/if_you_had_to_guess_how_will_you_die/",
        "user": "u/The_Reddit_Peasant8",
        "comments": [
            {
                "id": "commentCreamybaconwater121",
                "comment": "Cancer",
                "level": "1",
                "votes": "21",
                "user": "Creamybaconwater"
            },
            {
                "id": "commentMor_Hjordis21",
                "comment": "I think I'm with you, and a lot of others here too.",
                "level": "2",
                "votes": "1",
                "user": "Mor_Hjordis"
            },
            {
                "id": "commentartoftheR3Vote",
                "comment": "Ye",
                "level": "3",
                "votes": "Vote",
                "user": "artoftheR"
            },
            {
                "id": "commentTypicalEngineer12321",
                "comment": "Found the stats major",
                "level": "2",
                "votes": "1",
                "user": "TypicalEngineer123"
            },
            {
                "id": "commentOldMork118",
                "comment": "kissed to death by my latina mistress in a sauna, high and drunk.Please?",
                "level": "1",
                "votes": "18",
                "user": "OldMork"
            },
            {
                "id": "commentHughJanus352Vote",
                "comment": "Sauna is actually quite deadly, if you don't know what you are doing.2010 Sauna competitions ended after both were pulled out from there. Both suffered bad burn injuries, and the other one died of his injuries on the spot.Yearly many people pass out drunk in the sauna and died, and i have nearly met the same fate, but always someone has come in and check in on me. Seriously, it's no joke when the temperature gets over 120°C.",
                "level": "2",
                "votes": "Vote",
                "user": "HughJanus35"
            },
            {
                "id": "commenttrismett130",
                "comment": "I want to die like my grandfather did in his sleep!! Not like the screaming passengers in his car",
                "level": "1",
                "votes": "30",
                "user": "trismett"
            },
            {
                "id": "commentBadAssCodpiece23",
                "comment": "Fuck you lol",
                "level": "2",
                "votes": "3",
                "user": "BadAssCodpiece"
            },
            {
                "id": "commentAWPsiimov_YT21",
                "comment": "o_0",
                "level": "2",
                "votes": "1",
                "user": "AWPsiimov_YT"
            },
            {
                "id": "commentWatchRocketgo21",
                "comment": "👀-------lol",
                "level": "2",
                "votes": "1",
                "user": "WatchRocketgo"
            },
            {
                "id": "commentLeatherScary23572Vote",
                "comment": "Wha-",
                "level": "2",
                "votes": "Vote",
                "user": "LeatherScary2357"
            },
            {
                "id": "commentgodzirraaaaa2Vote",
                "comment": "Jack Handy 👏🏼👏🏼👏🏼",
                "level": "2",
                "votes": "Vote",
                "user": "godzirraaaaa"
            },
            {
                "id": "commentZealousIdealRejected18",
                "comment": "I think im going to be eaten by something, i just hope its not a person.",
                "level": "1",
                "votes": "8",
                "user": "ZealousIdealRejected"
            },
            {
                "id": "commentMor_Hjordis23",
                "comment": "Maybe an ant?",
                "level": "2",
                "votes": "3",
                "user": "Mor_Hjordis"
            },
            {
                "id": "commentLankyboxyman33",
                "comment": "I guess that works",
                "level": "3",
                "votes": "3",
                "user": "Lankyboxyman"
            },
            {
                "id": "commentstu_is_chok114",
                "comment": "suicide",
                "level": "1",
                "votes": "14",
                "user": "stu_is_chok"
            },
            {
                "id": "commentSolid-Water-881122",
                "comment": "You good ?",
                "level": "2",
                "votes": "2",
                "user": "Solid-Water-8811"
            },
            {
                "id": "commentWatchRocketgo22",
                "comment": "Please don't. Prove em wrong. Live like you stole it!",
                "level": "2",
                "votes": "2",
                "user": "WatchRocketgo"
            },
            {
                "id": "commentIDK_banana34",
                "comment": "Don't listen to him. He's just trying to hold you back. You do the best god damn suicide there ever was! I believe in you man.",
                "level": "3",
                "votes": "4",
                "user": "IDK_banana"
            },
            {
                "id": "commentThingPurple47",
                "comment": "LMAOOOOOO WHATTTTTT",
                "level": "4",
                "votes": "7",
                "user": "ThingPurple"
            },
            {
                "id": "commentdead_zombie55Vote",
                "comment": "Even his snoo is depressed",
                "level": "5",
                "votes": "Vote",
                "user": "dead_zombie5"
            },
            {
                "id": "commentWatchRocketgo43",
                "comment": "BAD Banana.......BAD.",
                "level": "4",
                "votes": "3",
                "user": "WatchRocketgo"
            },
            {
                "id": "commentdead_zombie52Vote",
                "comment": "Hey man don’t actually do it",
                "level": "2",
                "votes": "Vote",
                "user": "dead_zombie5"
            },
            {
                "id": "commentA_Bassline_Junkie14",
                "comment": "alone.",
                "level": "1",
                "votes": "4",
                "user": "A_Bassline_Junkie"
            },
            {
                "id": "commentThe_Reddit_Peasant822",
                "comment": "The only real answer.",
                "level": "2",
                "votes": "2",
                "user": "The_Reddit_Peasant8"
            },
            {
                "id": "commentcrb1113",
                "comment": "Dementia (or something caused by it).",
                "level": "1",
                "votes": "3",
                "user": "crb11"
            },
            {
                "id": "commentChemisfunni2Vote",
                "comment": "I think I will also suffer from something like that, and I am scared to death",
                "level": "2",
                "votes": "Vote",
                "user": "Chemisfunni"
            },
            {
                "id": "commentcrb113Vote",
                "comment": "Yes, me too. It seems to be in our family, and my mother is now at the stage where she can't always remember her own name. Very sad.",
                "level": "3",
                "votes": "Vote",
                "user": "crb11"
            },
            {
                "id": "commentgerbageman13",
                "comment": "An angry guy in a F-150 will run over me.",
                "level": "1",
                "votes": "3",
                "user": "gerbageman"
            },
            {
                "id": "commentChispy13",
                "comment": "Being uploaded to a quantum computer (biological or artificial.)",
                "level": "1",
                "votes": "3",
                "user": "Chispy"
            },
            {
                "id": "commentTypicalEngineer12322",
                "comment": "Now running Heaven.exe",
                "level": "2",
                "votes": "2",
                "user": "TypicalEngineer123"
            }
        ]
    },
    {
        "id": "what_is_the_single_greatest_failure_of_the_human",
        "title": "What is the single greatest failure of the human race?",
        "votes": "52",
        "link": "https://www.reddit.com/r/AskReddit/comments/v0xoej/what_is_the_single_greatest_failure_of_the_human/",
        "user": "u/PM_me_coolest_shit",
        "comments": [
            {
                "id": "commentprobabletrump1153",
                "comment": "Our inability to plan long term. We consistently plan for the moment, maybe the year. We don't plan for our lifetimes well at all and certainly not for the lifetimes coming after ours.Most of the problems facing humanity right now require long term planning to fix them. Those problems are starting to accumulate because we can't focus enough to solve any of them.",
                "level": "1",
                "votes": "153",
                "user": "probabletrump"
            },
            {
                "id": "commentWackyTabbacy42069221",
                "comment": "The problems of a caveman brain rapidly getting access to advanced tech. Hopefully some of that advanced tech will one day allow the caveman to transcend into something better able to deal with technological advances",
                "level": "2",
                "votes": "21",
                "user": "WackyTabbacy42069"
            },
            {
                "id": "commentRNBQ410336",
                "comment": "A lot of our evolution is linked to avoiding being killed by stuff we created, like cars or alcohol...",
                "level": "3",
                "votes": "6",
                "user": "RNBQ4103"
            },
            {
                "id": "commentprobabletrump310",
                "comment": "Personally I don't think that solution involves humans as we understand them. We're pretty shackled to the monkey brain. AI on the other hand......",
                "level": "3",
                "votes": "10",
                "user": "probabletrump"
            },
            {
                "id": "commentEdis3D25",
                "comment": "I would add to that - it's not that we don't plan long-term, but rather fail to execute the long term goals we set.",
                "level": "2",
                "votes": "5",
                "user": "Edis3D"
            },
            {
                "id": "commentprobabletrump37",
                "comment": "We abandon long term plans and goals precisely at the point that they create a short term cost or inconvenience.",
                "level": "3",
                "votes": "7",
                "user": "probabletrump"
            },
            {
                "id": "commentProfessional_Truck24",
                "comment": "I'd say its our more our lack of cooperation. Solving climate change will require the majority of the world's nations to pitch in and if they don't do that it won't matter if you've got a plan for the next century.",
                "level": "2",
                "votes": "4",
                "user": "Professional_Truck"
            },
            {
                "id": "commentraikaria235",
                "comment": "Yeah; simple fact is Europe and other countries can do as much as they like; but if the 2.5 billion in India and China don't play along, well; that's still a good 1/3 of the world's population...",
                "level": "3",
                "votes": "5",
                "user": "raikaria2"
            },
            {
                "id": "commentRNBQ410343",
                "comment": "China is putting a lot of effort on nuclear due to air pollution, India is moving in the same direction.",
                "level": "4",
                "votes": "3",
                "user": "RNBQ4103"
            },
            {
                "id": "commentMagicalWhisk22",
                "comment": "I've been saying this for a while now. Particularly in politics, short term planning to look good for an election in 2-4 years is having a huge impact on our long term projects. No political party in power wants to put actions into place they themselves won't be able to say \"look what we did\" because 20 years from now someone else in charge will take the credit.",
                "level": "2",
                "votes": "2",
                "user": "MagicalWhisk"
            },
            {
                "id": "commentMac_edthur141",
                "comment": "Voting a very corrupt son of a dictator",
                "level": "1",
                "votes": "41",
                "user": "Mac_edthur"
            },
            {
                "id": "comment1980pzx28",
                "comment": "Why did Canada do that?",
                "level": "2",
                "votes": "8",
                "user": "1980pzx"
            },
            {
                "id": "commentMoneyManiac14321",
                "comment": "The Philippines actually. Fucking dumbfucks just voted anyone popular",
                "level": "3",
                "votes": "21",
                "user": "MoneyManiac14"
            },
            {
                "id": "commentAussieCollector410",
                "comment": "Yup. Imagine Voting in Marcos again. All the people who lived during his fathers term should be outraged at this.",
                "level": "4",
                "votes": "10",
                "user": "AussieCollector"
            },
            {
                "id": "commentbirdlawexpert695Vote",
                "comment": "Youd be surprised how effective the Marcos disinformation campaign has been. Amazing how simply throwing money at spreading disinformation has been so powerful.",
                "level": "5",
                "votes": "Vote",
                "user": "birdlawexpert69"
            },
            {
                "id": "commentstench_of_bf204217",
                "comment": "BF2042",
                "level": "1",
                "votes": "7",
                "user": "stench_of_bf2042"
            },
            {
                "id": "commentOptisrule22",
                "comment": "Bf1942 remake would have been soooo much better",
                "level": "2",
                "votes": "2",
                "user": "Optisrule"
            },
            {
                "id": "commentEuropheus128",
                "comment": "You",
                "level": "1",
                "votes": "28",
                "user": "Europheus"
            },
            {
                "id": "commentPM_me_coolest_shit216",
                "comment": "Finally someone gets it.",
                "level": "2",
                "votes": "16",
                "user": "PM_me_coolest_shit"
            },
            {
                "id": "commentaridcool22",
                "comment": "Reminds me of the old \"50 Most Loathesome People\" lists that used to be put out annually in Buffalo Beast. Now Buffalo Beast is defunct (or at least their domain has gotten bought by a casino?) and Ian, the guy who did them, has passed away I believe. Funny stuff. There were a few years where he listed \"You\" and at least one year where he listed \"me\".",
                "level": "2",
                "votes": "2",
                "user": "aridcool"
            },
            {
                "id": "commentPrussia_I22",
                "comment": "Steven, you are a failure",
                "level": "2",
                "votes": "2",
                "user": "Prussia_I"
            },
            {
                "id": "commenti-am-your-god-now191",
                "comment": "The collective unwillingness to do anything substantial about climate change.",
                "level": "1",
                "votes": "91",
                "user": "i-am-your-god-now"
            },
            {
                "id": "commentlotusbombb22",
                "comment": "Me: “Meat is one of the biggest contributors of climate change, you should greatly limit your intake”Environmentalists: But bacon tho”",
                "level": "2",
                "votes": "2",
                "user": "lotusbombb"
            },
            {
                "id": "commentOk_Wonder_160423",
                "comment": "Definitely this",
                "level": "2",
                "votes": "3",
                "user": "Ok_Wonder_1604"
            },
            {
                "id": "commentJouuf21",
                "comment": "\"Fuck the planet, the planet can save itself\"-People",
                "level": "2",
                "votes": "1",
                "user": "Jouuf"
            },
            {
                "id": "commentArtimusP151",
                "comment": "Not overcoming greed as a species. We are capable of so much and posses deep self awareness but we can't seem to shake those basic primal instincts.",
                "level": "1",
                "votes": "51",
                "user": "ArtimusP"
            },
            {
                "id": "commentGermaneRiposte101211",
                "comment": "We got to the top because of those basic primal instincts.",
                "level": "2",
                "votes": "11",
                "user": "GermaneRiposte101"
            },
            {
                "id": "commentchriswaco36",
                "comment": "Exactly. Humans without greed would still be living in caves naked.",
                "level": "3",
                "votes": "6",
                "user": "chriswaco"
            },
            {
                "id": "commentJouuf45",
                "comment": "idk naked cave sounds alright to me",
                "level": "4",
                "votes": "5",
                "user": "Jouuf"
            },
            {
                "id": "commentImSigmundFraud5Vote",
                "comment": "For rent: 1 cave, no utiltiies, no pets, no bed. $1800pp/pm.Some landlord in the GTA probabaly",
                "level": "5",
                "votes": "Vote",
                "user": "ImSigmundFraud"
            },
            {
                "id": "commentCooctoos21",
                "comment": "I’m a highschool student learning about American history this school year. I knew 19th century America wasn’t the greatest place, but all the selfishness and racism that I’ve learned about changed my opinion on the country totally",
                "level": "2",
                "votes": "1",
                "user": "Cooctoos"
            }
        ]
    },
    {
        "id": "whats_a_thing_dumb_people_say_that_makes_them",
        "title": "What’s a thing dumb people say that makes them think they sound smart?",
        "votes": "2062",
        "link": "https://www.reddit.com/r/AskReddit/comments/v0conk/whats_a_thing_dumb_people_say_that_makes_them/",
        "user": "u/TheArchitect_7",
        "comments": [
            {
                "id": "commentbcopes158121k",
                "comment": "Thinking that getting a reaction out of someone is the same thing as winning an argument.",
                "level": "1",
                "votes": "2.1k",
                "user": "bcopes158"
            },
            {
                "id": "commentsylvanwhisper2505",
                "comment": "My ex used to goad me into some stupid debate, and I would tell him I decline to engage. He'd then say if I had nothing to contribute to the argument, then I was in the wrong, and he would take my refusal to go around and around for hours as him winning the argument.",
                "level": "2",
                "votes": "505",
                "user": "sylvanwhisper"
            },
            {
                "id": "commentSaeedUnknown3169",
                "comment": "I can see why is he your ex",
                "level": "3",
                "votes": "169",
                "user": "SaeedUnknown"
            },
            {
                "id": "commentSuspicious-Muscle-963163",
                "comment": "Neckbeard script within a romantic relationship? Please tell me you dumped him savagely.",
                "level": "3",
                "votes": "163",
                "user": "Suspicious-Muscle-96"
            },
            {
                "id": "commentNotarussianbot2020473",
                "comment": "I wouldn't even attribute this to neckbeard status. This is full body wookie suit.",
                "level": "4",
                "votes": "73",
                "user": "Notarussianbot2020"
            },
            {
                "id": "commentcheezygritz3515",
                "comment": "Woah. Back off the wookies. They had no part in this.",
                "level": "5",
                "votes": "15",
                "user": "cheezygritz3"
            },
            {
                "id": "commentAppropriate_Donkey18133k",
                "comment": "\"You wouldn't understand.\" Yeah, that's why I asked you for an explanation.",
                "level": "1",
                "votes": "3.3k",
                "user": "Appropriate_Donkey18"
            },
            {
                "id": "commentcisforcoffee2906",
                "comment": "My response to this is almost always, \"Ok, so explain it to me.\"",
                "level": "2",
                "votes": "906",
                "user": "cisforcoffee"
            },
            {
                "id": "commentthrowaway-_-friend3340",
                "comment": "Eta: /s",
                "level": "3",
                "votes": "340",
                "user": "throwaway-_-friend"
            },
            {
                "id": "commentDirtFoot794285",
                "comment": "\"Just think about it\", \"Follow the money\", or my favourites \"it's obvious\" or \"it's common sense\"",
                "level": "4",
                "votes": "285",
                "user": "DirtFoot79"
            },
            {
                "id": "commentElectrical_Age_3365103",
                "comment": "For forgot \"be reasonable.\" Like, I'm tryin to, but you don't appear to since you won't explain your viewpoint.",
                "level": "5",
                "votes": "103",
                "user": "Electrical_Age_336"
            },
            {
                "id": "commentpyro_technix537",
                "comment": "I love questioning the common sense ones even if I agree but they're condescending to someone else. Like okay, explain it if it's so easy to you then",
                "level": "5",
                "votes": "37",
                "user": "pyro_technix"
            },
            {
                "id": "commentgroovyinutah332",
                "comment": "I have all day...",
                "level": "3",
                "votes": "32",
                "user": "groovyinutah"
            },
            {
                "id": "commentgigi_courcelle2143",
                "comment": "My MIL’s neighbour is a firm believer that Covid is created by the government to control us. They had an amazing friendly neighbourly relationship until the pandemic. She took the time, she wanted to understand his position.Him : you wouldn’t understand, I made so much researchHer : well please explain, that is why we are talking right nowHim : we don’t have the timeHer : do you have anything planned this afternoon? I don’tHim : noHer : so we do have the timeHim : but you wouldn’t understand",
                "level": "2",
                "votes": "143",
                "user": "gigi_courcelle"
            },
            {
                "id": "commentAlone_Ad1278131k",
                "comment": "I sometimes use big words that I don't really understand to make myself sound more ambidextrous..",
                "level": "1",
                "votes": "3.1k",
                "user": "Alone_Ad1278"
            },
            {
                "id": "commentDrOctaviusWentworth2465",
                "comment": "That makes you sound quite diffident in an obstreperous manner.",
                "level": "2",
                "votes": "465",
                "user": "DrOctaviusWentworth"
            },
            {
                "id": "commentfinalmantisy833246",
                "comment": "Frankly, I can't stand when people fake osteoporosisity to appear as refined intellectuals.",
                "level": "3",
                "votes": "246",
                "user": "finalmantisy83"
            },
            {
                "id": "commentGozerDGozerian4140",
                "comment": "This whole discussion is giving my geopolitical epicondyles a Kafkaesque case of photosynthesis.",
                "level": "4",
                "votes": "140",
                "user": "GozerDGozerian"
            },
            {
                "id": "commentrealbasilisk5114",
                "comment": "Guys! Stop being so indigenous to each other!",
                "level": "5",
                "votes": "114",
                "user": "realbasilisk"
            },
            {
                "id": "commentmyflippinggoodness657",
                "comment": "But it's so goddamn superfluous! Are you unable to see the implicit somnambulism of that argument right there? I mean boom. I mean, it's like you said, integers",
                "level": "6",
                "votes": "57",
                "user": "myflippinggoodness"
            },
            {
                "id": "commentLeon500111714",
                "comment": "Yeah, you are all enthusiastic in velocity!",
                "level": "7",
                "votes": "14",
                "user": "Leon500111"
            },
            {
                "id": "commentAerieEastern67988",
                "comment": "Supercalifragilistitastidociallat—OWWWW!! FUCK! I bit my tongue!",
                "level": "8",
                "votes": "8",
                "user": "AerieEastern679"
            },
            {
                "id": "commentTheREALbObRossco422",
                "comment": "I'm very flumberflude to see gametes on a marathon tohumberflube across the pentameter to ever have the pandiculation occur in their minds",
                "level": "4",
                "votes": "22",
                "user": "TheREALbObRossco"
            },
            {
                "id": "commentIn_The_Comments267",
                "comment": "It's a perfectly cromulent word.",
                "level": "2",
                "votes": "67",
                "user": "In_The_Comments"
            },
            {
                "id": "commentlurker-deluxe285",
                "comment": "On the one hand that sounds like a good idea but on the other hand..",
                "level": "2",
                "votes": "85",
                "user": "lurker-deluxe"
            },
            {
                "id": "commentTru-Queer2212",
                "comment": "I too like to masturbate big words into my conversations to appear smarter",
                "level": "2",
                "votes": "212",
                "user": "Tru-Queer"
            },
            {
                "id": "commentdavidNerdly37",
                "comment": "So i wanted this to be proper usage sooooo bad. I even went to some lower results for my “hey siri define masturbate” hoping to find a secondary meaning for it. Sadly it’s all about stimulatin them genitalia, typically resulting in orgasm.Maybe it’ll make its rounds into all that slang the keeps getting made up. If drip means your style and look then someday… someday i’ll be masturbate into so many things and have all sorts of folks masturbate right back at me.",
                "level": "3",
                "votes": "7",
                "user": "davidNerdly"
            },
            {
                "id": "commentWongoKnight1691",
                "comment": "Something along the lines of “You can’t prove it didn’t happen”.A guy at work tried to pull this one on me. He believed one of those Animal Planet mockumentaries about a giant killer shark was real. When I told him it was all fiction and that there was no real proof of this kind of stuff, he tried to argue back about while he couldn’t prove it, I couldn’t disprove it either.There’s a saying about getting into an argument with a stupid person. This was my real world experience with it.",
                "level": "1",
                "votes": "691",
                "user": "WongoKnight"
            },
            {
                "id": "commentSolDarkHunter233",
                "comment": "\"You can't prove it's not\" is largely meaningless.The burden of proof is on the one making the claim. Nobody needs to prove it didn't happen. You need to prove that it did, because you're the one claiming it did.If your only defense is \"I don't think it's completely impossible\"... well, that's really not worth anything.",
                "level": "2",
                "votes": "33",
                "user": "SolDarkHunter"
            },
            {
                "id": "commentSupraman832166",
                "comment": "Hang on I can disprove it. It's a mockumentary about the megalodon still existing. It doesn't. Period. Here's why, the newest megalodon teeth found are 10,000 years old nothing newer. There would be supporting evidence of their existence from whales, scars, carcasses with the correct bite sizes taken out, damage to the bones that could only be done by a megalodon tooth. There is a 0% chance the megalodon is still alive. Also the argument that it's a deep water shark is weak at best, the megalodon was most likely related to the great white and had similar traits which makes it a coastal sharkEdit: also the carbon dating method used to get teeth only 10,000 years old isn't the most accurate method so most likely those teeth are much much older.",
                "level": "2",
                "votes": "166",
                "user": "Supraman83"
            },
            {
                "id": "commentWongoKnight371",
                "comment": "Actually, it was the other giant killer shark mockumentary. Yes, there are several. It was the one about Submarine, a larger than usual Great white that was apparently as intelligent as an orca. Still plenty of bad CGI and pseudoscience.I mentioned this story of mine in another post somewhere and homebody replied on how they knew someone who believed the mermaid one was real.",
                "level": "3",
                "votes": "71",
                "user": "WongoKnight"
            }
        ]
    }
]